{
  "en": {
    "main-title": "123Trig",
    "tagline": "Your Trigonometry Pal — learn and calculate fast with visual tools.",
    "subtitle": "Learn and calculate areas, volumes, and perimeters of geometric figures in seconds.<br>123Trig is a free, multilingual visual tool — ideal for middle and high school students.",
    "personal-take": "<strong>Little intro:</strong><br>Geometry isn’t just about shapes on paper — it’s the secret behind so many everyday things! From figuring out how many tiles fit in your bathroom, to how much paint covers your walls, or even picking the right air conditioner for your room — it’s all geometry.<br>Once you see it, you can’t unsee it!",
    "landing-intro": "🔎 Select a shape below and enter its dimensions to get instant results. Calculations update automatically in your language.<br>You can also navigate using the <strong>top menu</strong>.",
    "perimeter": "Perimeter",
    "area": "Area",
    "surface-area": "Surface Area",
    "volume": "Volume",
    "units": "units",
    "radius": "Radius:",
    "side": "Side (a):",
    "length": "Length (l):",
    "width": "Width (w):",
    "height": "Height (h):",
    "base": "Base (b):",
    "3dheight": "Height (H):",
    "square": "Square",
    "rhombus": "Rhombus",
    "parallelogram": "Parallelogram",
    "cube": "Cube",
    "rect": "Rectangle",
    "rect-prism": "Rectangular Prism",
    "triangle": "Triangle",
    "triangle-right": "Right Triangle",
    "triangle-iso": "Isosceles Triangle",
    "triangle-equi": "Equilateral Triangle",
    "triangle-pyramid": "Triangular Pyramid (tetrahedron)",
    "triangle-family": "Triangle Family",
    "apothem": "Apothem (ap):",
    "circle": "Circle",
    "major-axis": "Semi-major axis (a):",
    "minor-axis": "Semi-minor axis (b):",
    "sphere": "Sphere",
    "cylinder": "Cylinder",
    "cone": "Cone",
    "generic-prism": "Generic Right Prism",
    "oblique-prism": "Generic Oblique Prism",
    "generic-pyramid": "Generic Right Pyramid",
    "oblique-pyramid": "Generic Oblique Pyramid",
    "diagonal-1": "Diagonal 1 (d₁):",
    "diagonal-2": "Diagonal 2 (d₂):",
    "sides": "Side:",
    "base-area": "Base area (A):",
    "base-perimeter": "Base perimeter (P):",
    "suggestion-banner": "💡 Help me get better — got feedback?",
    "slant-height": "Slant height (l):",
    "send-here": "Send it here",
    "not-implemented": "N/A",

    "desc-square": "A square has four equal sides and right angles. Use it to calculate area and perimeter easily.",
    "desc-cube": "A cube is a 3D shape with six equal square faces. It lets you compute volume and surface area.",
    "desc-rect": "A rectangle has opposite sides equal. Quickly find its area and perimeter with two sides.",
    "desc-rhombus": "A rhombus has four equal sides but tilted angles. It often looks like a diamond in patterns and kites.",
    "desc-parallelogram": "A parallelogram has opposite sides equal and parallel — like a pushed-over rectangle.",
    "desc-rect-prism": "A rectangular prism is a box-shaped 3D object. Use it to find surface area and volume.",
    "desc-triangle-right": "A right triangle has one 90° angle. It’s the shape behind Pythagoras’ theorem and countless designs.",
    "desc-triangle-iso": "An isosceles triangle has two equal sides and a balanced look — symmetry made simple.",
    "desc-triangle-equi": "An equilateral triangle has all sides and angles equal — pure geometric harmony.",
    "desc-triangle": "A triangle has three sides. With base and height, you can get its area fast.",
    "desc-triangle-pyramid": "A triangular pyramid has a triangular base and three triangular faces. You can calculate its volume easily.",
    "desc-circle": "A circle is a 2D shape with a constant radius. Compute its area and perimeter in one step.",
    "desc-pentagon": "A pentagon has five equal sides and angles — a first step into regular polygons.",
    "desc-hexagon": "A hexagon has six equal sides — nature’s favorite shape in honeycombs and crystals.",
    "desc-ngon": "Regular polygons with many sides start to look like circles — the more sides, the smoother.",
    "desc-ellipse": "A stretched circle (oval) defined by two semi-axes.",
    "desc-sphere": "A sphere is a perfectly round 3D shape. Use its radius to get surface area and volume.",
    "desc-cylinder": "A cylinder has two circular faces and a height. Get surface area and volume with simple inputs.",
    "desc-cone": "A cone has a circular base and tapers to a point. Compute area and volume with radius and height.",

    "desc-perimeter": "<strong>Perimeter</strong> is the total length around a shape. It’s straightforward for polygons.",
    "desc-area": "<strong>Area</strong> is the space inside a 2D shape. Each figure has a specific formula.",
    "desc-volume": "<strong>Volume</strong> measures how much space a 3D shape occupies, in cubic units.",
    "desc-surface-area": "<strong>Surface area</strong> is the total area of all faces of a 3D object.",

    "desc-generic-prism": "A prism built from any polygonal base. As long as you know the base area, you can get its volume.",
    "desc-generic-pyramid": "Any pyramid follows the same logic: with the base area and height, you can get the volume.",

    "desc-oblique-prism": "An oblique prism has the same base as a right prism but is slanted — the sides are parallelograms instead of rectangles.",
    "desc-oblique-pyramid": "An oblique pyramid has a shifted apex — it’s tilted, but its volume is still one-third of the corresponding prism.",

    "definitions": "Definitions",

    "nav-home": "Home",
    "nav-about": "About",
    "nav-privacy": "Privacy",
    "nav-contact": "Contact",
    "nav-feedback": "💡 Feedback",
    "nav-terms": "Terms",

    "section-2d": "🟪 The 2D Universe — or Flatland!",
    "section-2d-desc": "Welcome to Flatland — a world with only length and width, no depth allowed! It’s where geometry begins: the realm of drawings, tiles, and blueprints.",
    "section-3d": "🌐 The 3D Universe — Space Awaits!",
    "section-3d-desc": "Step into the world of depth, height, and width — where geometry comes alive! Explore cubes, prisms, cylinders, cones, and spheres.",

    "footer-rights": "All rights reserved.",
    "contact-title": "Contact",
    "contact-p1": "Have feedback or suggestions? I'd love to hear from you.",
    "contact-p2": "Use the feedback button at the top to send your message via Google Forms.",
    "contact-p3": "I read everything, even if I can't always reply. Thanks for helping improve 123Trig.",

    "privacy-title": "Privacy Policy",
    "privacy-p1": "We do not collect personal data directly.",
    "privacy-p2": "Google AdSense may use cookies to personalize ads. See Google’s policy for more info.",

    "about-title": "About",
    "about-p1": "123Trig is a free visual calculator designed to help students quickly understand and solve geometry problems. It was born out of a personal frustration: I often saw students struggling with formulas that felt more complicated than they needed to be.",
    "about-p2": "I wanted to create something pragmatic, logical, and simple — a clean, fast tool focused on clarity and results, not noise or distractions.",
    "about-p3": "Want the result? Go for it. Forgot the formula? It’s right there. 123Trig was built to remove friction — so you can calculate faster, learn visually, and move on.",

    "terms-title": "Terms of Service",
    "terms-p1": "123Trig is a free educational tool. Use it at your own discretion.",
    "terms-p2": "While we aim for accuracy, we do not guarantee that all results are free of errors.",
    "terms-p3": "By using this site, you agree not to use it for unlawful or malicious purposes.",

    "hint-triangle-pyramid": "💡 The volume of a triangular pyramid is the area of its base times its height, all divided by 3. Why? Because three identical pyramids can fit into a triangular prism.",
    "hint-rhombus": "💡 A rhombus is just a parallelogram with all sides equal. If you know the height, the area is a × h.",
    "hint-triiso": "💡 An isosceles triangle can be seen as two right triangles back to back.",
    "hint-trieq": "💡 Same spirit: an equilateral triangle relates neatly to right-triangle reasoning. Pythagoras does the heavy lifting; height isn’t even needed if you know a.",
    "hint-triR": "💡 If there’s ONE thing to remember forever, it’s Pythagoras’ theorem.",
    "hint-pentagon": "💡 Everything looks like a combination of triangles if you look closely. A regular pentagon is 5 isosceles triangles. Its area is 5 times the area of one.",
    "hint-hexagon": "💡 A regular hexagon is 6 equilateral triangles, so its area is 6 × the equilateral-triangle formula. You don’t need the apothem, but you can use it if you have it.",
    "hint-ngon": "💡 All regular polygons are just a bunch of isosceles triangles — hence the similar formulas. As n increases and a decreases, the figure resembles a circle. The area idea aligns: perimeter × radius (apothem).",
    "hint-circle": "💡 Here it is — the “infinigon.”",
    "hint-ellipse": "💡 The ellipse is tricky: its perimeter has no simple closed form — we use approximations. (Yes, this still interests mathematicians!)",
    "hint-gprism": "💡 A prism’s <strong>volume</strong> depends only on base area and height. For <strong>surface area</strong>, add the two base areas and the lateral area (perimeter × h).<br><strong>Key rule:</strong> decomposition — slice hard shapes into easy pieces.",
    "hint-goprism": "💡 Tilt a prism and the volume formula stays the same. Surface area gets harder: the sides become parallelograms; compute each and sum with the two bases.",
    "hint-gpyramid": "💡 Every pyramid’s volume equals one-third of the prism with the same base and height.",
    "hint-gopyramid": "💡 When the apex shifts sideways, the pyramid is oblique — the volume formula stays the same, but surface area is harder: each side is a triangle; compute each and sum with the base.",

    "menu-handle": "MENU",
    "menu-top": "Top",
    "menu-2d": "2D Figures",
    "menu-3d": "3D Solids"
  },
  "es": {
    "main-title": "123Trig",
    "tagline": "Tu compañero de trigonometría — aprende y calcula rápido con herramientas visuales.",
    "subtitle": "Aprende y calcula áreas, volúmenes y perímetros de figuras geométricas en segundos.<br>123Trig es una herramienta visual gratuita y multilingüe — ideal para estudiantes de secundaria y preparatoria.",
    "personal-take": "<strong>Pequeña introducción:</strong><br>La geometría no trata solo de figuras en papel — es el secreto detrás de muchas cosas cotidianas. Desde saber cuántos azulejos caben en tu baño, hasta cuánta pintura necesitas para tus paredes, o elegir el aire acondicionado adecuado para tu habitación — todo es geometría.<br>Una vez que lo entiendes, lo ves en todas partes.",
    "landing-intro": "🔎 Selecciona una figura abajo e ingresa sus dimensiones para obtener resultados instantáneos. Los cálculos se actualizan automáticamente en tu idioma.<br>También puedes navegar usando el <strong>menú superior</strong>.",

    "perimeter": "Perímetro",
    "area": "Área",
    "surface-area": "Área superficial",
    "volume": "Volumen",
    "units": "unidades",
    "radius": "Radio:",
    "side": "Lado (a):",
    "length": "Largo (l):",
    "width": "Ancho (w):",
    "height": "Altura (h):",
    "base": "Base (b):",
    "3dheight": "Altura (H):",
    "pyr-height": "Altura de la Pirámide (H):",
    "apothem": "Apotema (ap):",
    "major-axis": "Semieje mayor (a):",
    "minor-axis": "Semieje menor (b):",
    "diagonal-1": "Diagonal 1 (d₁):",
    "diagonal-2": "Diagonal 2 (d₂):",
    "base-area": "Área de la base (A):",
    "base-perimeter": "Perímetro de la base (P):",
    "slant-height": "Altura inclinada (l):",

    "square": "Cuadrado",
    "rhombus": "Rombo",
    "parallelogram": "Paralelogramo",
    "cube": "Cubo",
    "rect": "Rectángulo",
    "rect-prism": "Prisma rectangular",
    "triangle": "Triángulo",
    "triangle-right": "Triángulo rectángulo",
    "triangle-iso": "Triángulo isósceles",
    "triangle-equi": "Triángulo equilátero",
    "triangle-family": "Familia de triángulos",
    "triangle-pyramid": "Pirámide triangular (tetraedro)",
    "circle": "Círculo",
    "pentagon": "Pentágono",
    "hexagon": "Hexágono",
    "ngon": "Polígono regular (n-gon)",
    "ellipse": "Elipse",
    "sphere": "Esfera",
    "cylinder": "Cilindro",
    "cone": "Cono",
    "generic-prism": "Prisma recto genérico",
    "oblique-prism": "Prisma oblicuo genérico",
    "generic-pyramid": "Pirámide recta genérica",
    "oblique-pyramid": "Pirámide oblicua genérica",

    "suggestion-banner": "💡 Ayúdame a mejorar — ¿tienes sugerencias?",
    "send-here": "Envíalas aquí",
    "not-implemented": "N/A",

    "desc-square": "Un cuadrado tiene cuatro lados iguales y ángulos rectos. Úsalo para calcular su área y perímetro fácilmente.",
    "desc-rhombus": "Un rombo tiene cuatro lados iguales pero ángulos inclinados. Es la figura en forma de diamante que ves en muchos diseños o cometas.",
    "desc-parallelogram": "Un paralelogramo tiene lados opuestos iguales y paralelos — como un rectángulo inclinado.",
    "desc-cube": "Un cubo es una figura tridimensional con seis caras cuadradas iguales. Permite calcular volumen y área superficial.",
    "desc-rect": "Un rectángulo tiene lados opuestos iguales. Con solo largo y ancho puedes hallar su área y perímetro.",
    "desc-rect-prism": "Un prisma rectangular es un sólido con forma de caja. Usa largo, ancho y altura para hallar área superficial y volumen.",
    "desc-triangle": "Un triángulo tiene tres lados. Con base y altura puedes calcular su área rápidamente.",
    "desc-triangle-right": "Un triángulo rectángulo tiene un ángulo de 90°. Es la base del teorema de Pitágoras y muchas estructuras reales.",
    "desc-triangle-iso": "Un triángulo isósceles tiene dos lados iguales y apariencia simétrica — geometría equilibrada.",
    "desc-triangle-equi": "Un triángulo equilátero tiene todos sus lados y ángulos iguales — pura armonía geométrica.",
    "desc-triangle-pyramid": "Una pirámide triangular tiene una base triangular y tres caras laterales también triangulares.",
    "desc-circle": "Un círculo es una figura plana con radio constante. Calcula su área y perímetro en un solo paso.",
    "desc-pentagon": "Un pentágono tiene cinco lados iguales y ángulos congruentes — la puerta de entrada a los polígonos regulares.",
    "desc-hexagon": "Un hexágono tiene seis lados iguales — la forma favorita de la naturaleza, visible en panales y cristales.",
    "desc-ngon": "Los polígonos regulares con muchos lados comienzan a parecerse a un círculo. Cuantos más lados, más suave se vuelve su contorno.",
    "desc-ellipse": "Una elipse es un círculo estirado definido por dos semiejes.",
    "desc-sphere": "Una esfera es una figura tridimensional perfectamente redonda. Usa su radio para obtener área y volumen.",
    "desc-cylinder": "Un cilindro tiene dos bases circulares y una altura. Calcula su área superficial y volumen con fórmulas simples.",
    "desc-cone": "Un cono tiene una base circular y termina en un vértice. Su volumen y área dependen del radio y la altura.",
    "desc-generic-prism": "Un prisma construido sobre cualquier base poligonal. Si conoces el área de la base, puedes hallar su volumen.",
    "desc-oblique-prism": "Un prisma oblicuo tiene la misma base que un prisma recto pero está inclinado — sus caras laterales son paralelogramos.",
    "desc-generic-pyramid": "Toda pirámide sigue la misma lógica: con el área de la base y su altura puedes hallar el volumen.",
    "desc-oblique-pyramid": "Una pirámide oblicua tiene su vértice desplazado. Su volumen no cambia, pero el cálculo del área superficial requiere sumar cada cara triangular por separado.",

    "desc-perimeter": "<strong>Perímetro:</strong> longitud total alrededor de una figura. Suma todos sus lados.",
    "desc-area": "<strong>Área:</strong> superficie interna de una figura plana. Cada una tiene su propia fórmula.",
    "desc-volume": "<strong>Volumen:</strong> mide el espacio que ocupa una figura 3D, expresado en unidades cúbicas.",
    "desc-surface-area": "<strong>Área superficial:</strong> suma de las áreas de todas las caras de un sólido.",

    "definitions": "Definiciones",

    "nav-home": "Inicio",
    "nav-about": "Acerca",
    "nav-privacy": "Privacidad",
    "nav-contact": "Contacto",
    "nav-feedback": "💡 Sugerencias",
    "nav-terms": "Términos",

    "footer-rights": "Todos los derechos reservados.",
    "contact-title": "Contacto",
    "contact-p1": "¿Tienes sugerencias o comentarios? Me encantaría escucharte.",
    "contact-p2": "Usa el botón de sugerencias arriba para enviar tu mensaje mediante Google Forms.",
    "contact-p3": "Leo todo, aunque no siempre pueda responder. Gracias por ayudar a mejorar 123Trig.",

    "privacy-title": "Política de Privacidad",
    "privacy-p1": "No recopilamos datos personales directamente.",
    "privacy-p2": "Google AdSense puede usar cookies para personalizar anuncios. Consulta la política de Google para más información.",

    "about-title": "Acerca de",
    "about-p1": "123Trig es una calculadora visual gratuita diseñada para ayudar a los estudiantes a comprender y resolver problemas de geometría de forma rápida. Nació de una frustración personal: veía a muchos estudiantes complicarse con fórmulas más difíciles de lo necesario.",
    "about-p2": "Quise crear algo pragmático, lógico y simple — una herramienta limpia, rápida y enfocada en la claridad y los resultados.",
    "about-p3": "¿Quieres el resultado? Adelante. ¿Olvidaste la fórmula? Ahí está. 123Trig fue creada para eliminar fricción: calcula más rápido, aprende visualmente y sigue adelante.",

    "terms-title": "Términos de Servicio",
    "terms-p1": "123Trig es una herramienta educativa gratuita. Úsala bajo tu propio criterio.",
    "terms-p2": "Aunque buscamos precisión, no garantizamos que todos los resultados estén libres de errores.",
    "terms-p3": "Al usar este sitio, aceptas no emplearlo con fines ilícitos o malintencionados.",

    "hint-triangle-pyramid": "💡 El volumen de una pirámide triangular es el área de su base multiplicada por la altura total y dividida entre 3. ¿Por qué? Porque tres pirámides iguales forman un prisma triangular.",
    "hint-rhombus": "💡 Un rombo es simplemente un paralelogramo con todos los lados iguales. Si conoces su altura, el área se calcula igual: a × h.",
    "hint-triiso": "💡 Un triángulo isósceles puede verse como dos triángulos rectángulos unidos por la base.",
    "hint-trieq": "💡 Igual que el isósceles, el triángulo equilátero puede descomponerse en triángulos rectángulos. ¡Pitágoras hace el trabajo pesado!",
    "hint-triR": "💡 Si hay una fórmula que debes recordar siempre, es el Teorema de Pitágoras.",
    "hint-pentagon": "💡 Todo parece una combinación de triángulos si observas con atención. Un pentágono regular está formado por 5 triángulos isósceles.",
    "hint-hexagon": "💡 Un hexágono regular está formado por 6 triángulos equiláteros, así que su área es 6 veces la del triángulo. Puedes usar el apotema si lo tienes.",
    "hint-ngon": "💡 Todos los polígonos regulares pueden verse como un conjunto de triángulos isósceles. A medida que n aumenta y los lados se reducen, la figura se aproxima a un círculo. La fórmula de área es similar: perímetro × apotema.",
    "hint-circle": "💡 Aquí está — ¡el \"infinígono\"!",
    "hint-ellipse": "💡 La elipse es especial: su perímetro no tiene una fórmula cerrada exacta, solo aproximaciones. (Sí, todavía intriga a los matemáticos).",
    "hint-gprism": "💡 El <strong>volumen</strong> de un prisma depende solo del área de la base y su altura. Para el <strong>área superficial</strong>, suma las dos bases y el área lateral (perímetro × h).<br><strong>Regla clave:</strong> descomposición — divide figuras complejas en partes simples.",
    "hint-goprism": "💡 Si inclinas un prisma, su volumen no cambia. Pero calcular el área superficial se complica: los lados se vuelven paralelogramos que deben sumarse uno por uno junto con las bases.",
    "hint-gpyramid": "💡 El volumen de toda pirámide equivale a un tercio del prisma con la misma base y altura.",
    "hint-gopyramid": "💡 Si el vértice se desplaza, la pirámide se vuelve oblicua — el volumen sigue igual, pero el cálculo del área superficial requiere sumar cada cara triangular más la base.",

    "section-2d": "🟪 El universo 2D — o Planolandia",
    "section-2d-desc": "Bienvenido a Planolandia: un mundo con solo largo y ancho, ¡sin profundidad permitida! Aquí comienza la geometría: el reino de los dibujos, los mosaicos y los planos.",
    "section-3d": "🌐 El universo 3D — ¡El espacio te espera!",
    "section-3d-desc": "Entra al mundo de la profundidad, la altura y el ancho — donde la geometría cobra vida. Explora cubos, prismas, cilindros, conos y esferas.",
    "menu-handle": "MENÚ",
    "menu-top": "Inicio",
    "menu-2d": "Figuras 2D",
    "menu-3d": "Sólidos 3D"
  },

  "fr": {
    "main-title": "123Trig",
    "tagline": "Ton compagnon de trigonométrie — apprends et calcule vite avec des outils visuels.",
    "subtitle": "Apprends et calcule les aires, volumes et périmètres des figures géométriques en quelques secondes.<br>123Trig est un outil visuel gratuit et multilingue — idéal pour les élèves du collège et du lycée.",
    "personal-take": "<strong>Petite intro :</strong><br>La géométrie n’est pas qu’une affaire de dessins sur papier — c’est le secret derrière bien des choses du quotidien ! Qu’il s’agisse de savoir combien de carreaux couvrent ta salle de bain, combien de peinture il faut pour un mur, ou même de choisir le bon climatiseur pour ta chambre — tout est géométrie.<br>Une fois que tu la comprends, tu la vois partout !",
    "landing-intro": "🔎 Sélectionne une figure ci-dessous et entre ses dimensions pour obtenir un résultat instantané. Les calculs s’adaptent automatiquement à ta langue.<br>Tu peux aussi naviguer avec le <strong>menu supérieur</strong>.",

    "perimeter": "Périmètre",
    "area": "Aire",
    "surface-area": "Aire de surface",
    "volume": "Volume",
    "units": "unités",
    "radius": "Rayon :",
    "side": "Côté (a) :",
    "length": "Longueur (l) :",
    "width": "Largeur (w) :",
    "height": "Hauteur (h) :",
    "base": "Base (b) :",
    "3dheight": "Hauteur (H) :",
    "pyr-height": "Hauteur de la pyramide (H) :",
    "apothem": "Apothème (ap) :",
    "major-axis": "Demi-grand axe (a) :",
    "minor-axis": "Demi-petit axe (b) :",
    "diagonal-1": "Diagonale 1 (d₁) :",
    "diagonal-2": "Diagonale 2 (d₂) :",
    "base-area": "Aire de la base (A) :",
    "base-perimeter": "Périmètre de la base (P) :",
    "slant-height": "Hauteur oblique (l) :",

    "square": "Carré",
    "rhombus": "Losange",
    "parallelogram": "Parallélogramme",
    "cube": "Cube",
    "rect": "Rectangle",
    "rect-prism": "Prisme rectangulaire",
    "triangle": "Triangle",
    "triangle-right": "Triangle rectangle",
    "triangle-iso": "Triangle isocèle",
    "triangle-equi": "Triangle équilatéral",
    "triangle-family": "Famille de triangles",
    "triangle-pyramid": "Pyramide triangulaire (tétraèdre)",
    "circle": "Cercle",
    "pentagon": "Pentagone",
    "hexagon": "Hexagone",
    "ngon": "Polygone régulier (n-gone)",
    "ellipse": "Ellipse",
    "sphere": "Sphère",
    "cylinder": "Cylindre",
    "cone": "Cône",
    "generic-prism": "Prisme droit générique",
    "oblique-prism": "Prisme oblique générique",
    "generic-pyramid": "Pyramide droite générique",
    "oblique-pyramid": "Pyramide oblique générique",

    "suggestion-banner": "💡 Aide-moi à m’améliorer — une idée ?",
    "send-here": "Envoie-la ici",
    "not-implemented": "N/A",

    "desc-square": "Un carré a quatre côtés égaux et quatre angles droits. Utilise-le pour calculer son aire et son périmètre facilement.",
    "desc-rhombus": "Un losange a quatre côtés égaux mais des angles inclinés. On le retrouve souvent en motif ou sur les cerfs-volants.",
    "desc-parallelogram": "Un parallélogramme a des côtés opposés égaux et parallèles — comme un rectangle penché.",
    "desc-cube": "Un cube est une figure 3D à six faces carrées égales. Il permet de calculer volume et aire de surface.",
    "desc-rect": "Un rectangle a des côtés opposés égaux. Avec sa longueur et sa largeur, tu peux trouver aire et périmètre.",
    "desc-rect-prism": "Un prisme rectangulaire est un solide en forme de boîte. Utilise ses dimensions pour calculer volume et aire de surface.",
    "desc-triangle": "Un triangle a trois côtés. Avec base et hauteur, tu obtiens rapidement son aire.",
    "desc-triangle-right": "Un triangle rectangle possède un angle de 90°. C’est la base du théorème de Pythagore et de nombreuses constructions.",
    "desc-triangle-iso": "Un triangle isocèle a deux côtés égaux et une allure équilibrée — la symétrie rendue simple.",
    "desc-triangle-equi": "Un triangle équilatéral a tous ses côtés et angles égaux — une harmonie géométrique parfaite.",
    "desc-triangle-pyramid": "Une pyramide triangulaire possède une base et trois faces triangulaires. On peut facilement en calculer le volume.",
    "desc-circle": "Un cercle est une figure plane définie par un rayon constant. Aire et périmètre se calculent d’un seul coup.",
    "desc-pentagon": "Un pentagone a cinq côtés égaux et angles réguliers — la première étape vers les polygones réguliers.",
    "desc-hexagon": "Un hexagone a six côtés égaux — la forme préférée de la nature, visible dans les rayons de miel et les cristaux.",
    "desc-ngon": "Les polygones réguliers à nombreux côtés ressemblent peu à peu à un cercle : plus il y a de côtés, plus la forme est lisse.",
    "desc-ellipse": "Une ellipse est un cercle étiré défini par deux demi-axes.",
    "desc-sphere": "Une sphère est une forme 3D parfaitement ronde. Son rayon suffit pour obtenir aire et volume.",
    "desc-cylinder": "Un cylindre a deux bases circulaires et une hauteur. Aire et volume se calculent aisément.",
    "desc-cone": "Un cône a une base circulaire et se termine en pointe. Aire et volume dépendent du rayon et de la hauteur.",
    "desc-generic-prism": "Un prisme peut avoir n’importe quelle base polygone. Si tu connais l’aire de la base, tu peux calculer son volume.",
    "desc-oblique-prism": "Un prisme oblique a la même base qu’un prisme droit, mais penché ; ses faces latérales sont des parallélogrammes.",
    "desc-generic-pyramid": "Toute pyramide suit la même logique : avec l’aire de base et la hauteur, tu obtiens le volume.",
    "desc-oblique-pyramid": "Une pyramide oblique a son sommet décalé : son volume reste le même, mais le calcul de surface est plus complexe.",

    "desc-perimeter": "<strong>Périmètre :</strong> longueur totale autour d’une figure. Additionne tous ses côtés.",
    "desc-area": "<strong>Aire :</strong> surface intérieure d’une figure plane. Chaque forme a sa propre formule.",
    "desc-volume": "<strong>Volume :</strong> mesure l’espace occupé par un solide, exprimé en unités cubiques.",
    "desc-surface-area": "<strong>Aire de surface :</strong> somme des aires de toutes les faces d’un solide.",

    "definitions": "Définitions",

    "nav-home": "Accueil",
    "nav-about": "À propos",
    "nav-privacy": "Confidentialité",
    "nav-contact": "Contact",
    "nav-feedback": "💡 Suggestions",
    "nav-terms": "Conditions",

    "footer-rights": "Tous droits réservés.",
    "contact-title": "Contact",
    "contact-p1": "Des suggestions ou des commentaires ? Je suis tout ouïe.",
    "contact-p2": "Utilise le bouton de feedback en haut pour m’écrire via Google Forms.",
    "contact-p3": "Je lis tout, même si je ne peux pas toujours répondre. Merci d’aider à améliorer 123Trig.",

    "privacy-title": "Politique de confidentialité",
    "privacy-p1": "Nous ne collectons aucune donnée personnelle directement.",
    "privacy-p2": "Google AdSense peut utiliser des cookies pour personnaliser les annonces. Consulte la politique de Google pour plus d’infos.",

    "about-title": "À propos",
    "about-p1": "123Trig est une calculatrice visuelle gratuite conçue pour aider les élèves à comprendre et résoudre rapidement des problèmes de géométrie. Elle est née d’une frustration personnelle : voir les élèves se compliquer la vie avec des formules inutiles.",
    "about-p2": "Je voulais créer un outil pragmatique, logique et simple — clair, rapide et sans distractions.",
    "about-p3": "Tu veux le résultat ? Le voilà. Tu as oublié la formule ? Elle est là. 123Trig vise à éliminer les frictions : calcule plus vite, apprends visuellement et passe à la suite.",

    "terms-title": "Conditions d’utilisation",
    "terms-p1": "123Trig est un outil éducatif gratuit. Utilise-le à ta propre discrétion.",
    "terms-p2": "Nous faisons tout pour garantir l’exactitude, mais sans assurer l’absence totale d’erreurs.",
    "terms-p3": "En utilisant ce site, tu acceptes de ne pas l’employer à des fins illégales ou malveillantes.",

    "section-2d": "🟪 L’univers 2D — ou Crêpeland !",
    "section-2d-desc": "Bienvenue à Crêpeland : un monde avec seulement longueur et largeur, sans profondeur permise ! C’est là que commence la géométrie : le domaine des dessins, carreaux et plans.",
    "section-3d": "🌐 L’univers 3D — l’espace t’attend !",
    "section-3d-desc": "Entre dans le monde de la profondeur, de la hauteur et de la largeur : là où la géométrie prend vie ! Explore cubes, prismes, cylindres, cônes et sphères.",

    "menu-handle": "MENU",
    "menu-top": "Haut de page",
    "menu-2d": "Figures 2D",
    "menu-3d": "Solides 3D"
  },
  "pt": {
    "main-title": "123Trig",
    "tagline": "Seu parceiro de trigonometria — aprenda e calcule rápido com ferramentas visuais.",
    "subtitle": "Aprenda e calcule áreas, volumes e perímetros de figuras geométricas em segundos.<br>123Trig é uma ferramenta visual gratuita e multilíngue — ideal para estudantes do ensino fundamental e médio.",
    "personal-take": "<strong>Pequena introdução:</strong><br>A geometria não trata apenas de figuras no papel — é o segredo por trás de muitas coisas do dia a dia! Desde saber quantos azulejos cabem no banheiro até quanta tinta você precisa para pintar uma parede, ou qual ar-condicionado escolher para o quarto — tudo é geometria.<br>Quando você entende, começa a ver em todos os lugares!",
    "landing-intro": "🔎 Selecione uma figura abaixo e insira suas dimensões para obter resultados instantâneos. Os cálculos são atualizados automaticamente no seu idioma.<br>Você também pode navegar usando o <strong>menu superior</strong>.",

    "perimeter": "Perímetro",
    "area": "Área",
    "surface-area": "Área de superfície",
    "volume": "Volume",
    "units": "unidades",
    "radius": "Raio:",
    "side": "Lado (a):",
    "length": "Comprimento (l):",
    "width": "Largura (w):",
    "height": "Altura (h):",
    "base": "Base (b):",
    "3dheight": "Altura (H):",
    "pyr-height": "Altura da Pirâmide (H):",
    "apothem": "Apótema (ap):",
    "major-axis": "Eixo maior (a):",
    "minor-axis": "Eixo menor (b):",
    "diagonal-1": "Diagonal 1 (d₁):",
    "diagonal-2": "Diagonal 2 (d₂):",
    "base-area": "Área da base (A):",
    "base-perimeter": "Perímetro da base (P):",
    "slant-height": "Altura inclinada (l):",

    "square": "Quadrado",
    "rhombus": "Losango",
    "parallelogram": "Paralelogramo",
    "cube": "Cubo",
    "rect": "Retângulo",
    "rect-prism": "Prisma retangular",
    "triangle": "Triângulo",
    "triangle-right": "Triângulo retângulo",
    "triangle-iso": "Triângulo isósceles",
    "triangle-equi": "Triângulo equilátero",
    "triangle-family": "Família dos triângulos",
    "triangle-pyramid": "Pirâmide triangular (tetraedro)",
    "circle": "Círculo",
    "pentagon": "Pentágono",
    "hexagon": "Hexágono",
    "ngon": "Polígono regular (n-gon)",
    "ellipse": "Elipse",
    "sphere": "Esfera",
    "cylinder": "Cilindro",
    "cone": "Cone",
    "generic-prism": "Prisma reto genérico",
    "oblique-prism": "Prisma oblíquo genérico",
    "generic-pyramid": "Pirâmide reta genérica",
    "oblique-pyramid": "Pirâmide oblíqua genérica",

    "suggestion-banner": "💡 Ajude-me a melhorar — tem alguma sugestão?",
    "send-here": "Envie aqui",
    "not-implemented": "N/A",

    "desc-square": "Um quadrado tem quatro lados iguais e ângulos retos. Use-o para calcular área e perímetro facilmente.",
    "desc-rhombus": "Um losango tem quatro lados iguais, mas ângulos inclinados. É a forma de diamante comum em padrões e pipas.",
    "desc-parallelogram": "Um paralelogramo tem lados opostos iguais e paralelos — como um retângulo inclinado.",
    "desc-cube": "Um cubo é uma forma tridimensional com seis faces quadradas iguais. Permite calcular volume e área de superfície.",
    "desc-rect": "Um retângulo tem lados opostos iguais. Com comprimento e largura, calcule área e perímetro rapidamente.",
    "desc-rect-prism": "Um prisma retangular é um sólido em forma de caixa. Use comprimento, largura e altura para achar volume e área de superfície.",
    "desc-triangle": "Um triângulo tem três lados. Com base e altura, calcule sua área facilmente.",
    "desc-triangle-right": "Um triângulo retângulo possui um ângulo de 90°. É a base do Teorema de Pitágoras e de várias construções reais.",
    "desc-triangle-iso": "Um triângulo isósceles tem dois lados iguais e aparência simétrica — pura elegância geométrica.",
    "desc-triangle-equi": "Um triângulo equilátero tem todos os lados e ângulos iguais — perfeita harmonia geométrica.",
    "desc-triangle-pyramid": "Uma pirâmide triangular possui uma base triangular e três faces laterais também triangulares.",
    "desc-circle": "Um círculo é uma figura plana com raio constante. Calcule área e perímetro em um único passo.",
    "desc-pentagon": "Um pentágono tem cinco lados e ângulos iguais — o primeiro passo no mundo dos polígonos regulares.",
    "desc-hexagon": "Um hexágono tem seis lados iguais — a forma preferida da natureza, visível em colmeias e cristais.",
    "desc-ngon": "Polígonos regulares com muitos lados começam a se parecer com um círculo: quanto mais lados, mais suave fica a forma.",
    "desc-ellipse": "Uma elipse é um círculo alongado definido por dois eixos.",
    "desc-sphere": "Uma esfera é uma forma tridimensional perfeitamente redonda. Use o raio para calcular área e volume.",
    "desc-cylinder": "Um cilindro possui duas bases circulares e uma altura. Calcule área de superfície e volume com facilidade.",
    "desc-cone": "Um cone tem base circular e termina em um vértice. O volume e a área dependem do raio e da altura.",
    "desc-generic-prism": "Um prisma formado a partir de qualquer base poligonal. Se você conhece a área da base, pode calcular o volume.",
    "desc-oblique-prism": "Um prisma oblíquo tem a mesma base de um prisma reto, mas é inclinado — as faces laterais são paralelogramos.",
    "desc-generic-pyramid": "Toda pirâmide segue a mesma lógica: conhecendo a área da base e a altura, calcule o volume.",
    "desc-oblique-pyramid": "Uma pirâmide oblíqua tem o vértice deslocado — o volume é o mesmo, mas a área de superfície requer somar cada face triangular separadamente.",

    "desc-perimeter": "<strong>Perímetro:</strong> soma de todos os lados de uma figura. Mede o contorno total.",
    "desc-area": "<strong>Área:</strong> espaço interno de uma figura plana. Cada forma tem sua própria fórmula.",
    "desc-volume": "<strong>Volume:</strong> mede o espaço ocupado por um sólido, em unidades cúbicas.",
    "desc-surface-area": "<strong>Área de superfície:</strong> soma das áreas de todas as faces de um sólido.",

    "definitions": "Definições",

    "nav-home": "Início",
    "nav-about": "Sobre",
    "nav-privacy": "Privacidade",
    "nav-contact": "Contato",
    "nav-feedback": "💡 Sugestões",
    "nav-terms": "Termos",

    "footer-rights": "Todos os direitos reservados.",
    "contact-title": "Contato",
    "contact-p1": "Tem sugestões ou comentários? Vou gostar de saber.",
    "contact-p2": "Use o botão de feedback acima para enviar sua mensagem pelo Google Forms.",
    "contact-p3": "Leio tudo, mesmo que nem sempre possa responder. Obrigado por ajudar a melhorar o 123Trig.",

    "privacy-title": "Política de Privacidade",
    "privacy-p1": "Não coletamos dados pessoais diretamente.",
    "privacy-p2": "O Google AdSense pode usar cookies para personalizar anúncios. Veja a política do Google para mais informações.",

    "about-title": "Sobre",
    "about-p1": "123Trig é uma calculadora visual gratuita criada para ajudar estudantes a compreender e resolver problemas de geometria rapidamente. Surgiu de uma frustração pessoal: ver alunos lutando com fórmulas mais complicadas do que o necessário.",
    "about-p2": "Quis criar algo prático, lógico e simples — uma ferramenta limpa, rápida e voltada para a clareza e os resultados.",
    "about-p3": "Quer o resultado? Vá em frente. Esqueceu a fórmula? Está aqui. O 123Trig foi feito para eliminar atrito: calcule mais rápido, aprenda visualmente e siga em frente.",

    "terms-title": "Termos de Serviço",
    "terms-p1": "123Trig é uma ferramenta educacional gratuita. Use por sua conta e risco.",
    "terms-p2": "Apesar de buscarmos precisão, não garantimos que todos os resultados estejam livres de erros.",
    "terms-p3": "Ao usar este site, você concorda em não utilizá-lo para fins ilegais ou mal-intencionados.",

    "section-2d": "🟪 O universo 2D — ou Planolândia!",
    "section-2d-desc": "Bem-vindo à Planolândia: um mundo com apenas comprimento e largura, sem profundidade! É aqui que a geometria começa — o reino dos desenhos, pisos e plantas.",
    "section-3d": "🌐 O universo 3D — o espaço espera por você!",
    "section-3d-desc": "Entre no mundo da profundidade, altura e largura — onde a geometria ganha vida! Explore cubos, prismas, cilindros, cones e esferas.",

    "menu-handle": "MENU",
    "menu-top": "Início",
    "menu-2d": "Figuras 2D",
    "menu-3d": "Sólidos 3D"
  },

  "de": {
    "main-title": "123Trig",
    "tagline": "Dein Trigonometrie-Begleiter – lerne und rechne schnell mit visuellen Werkzeugen.",
    "subtitle": "Lerne und berechne Flächen, Volumina und Umfänge geometrischer Figuren in Sekunden.<br>123Trig ist ein kostenloses, mehrsprachiges, visuelles Tool – ideal für Mittel- und Oberstufenschüler.",
    "personal-take": "<strong>Kurze Einführung:</strong><br>Geometrie ist nicht nur Zeichnen auf Papier – sie steckt hinter vielen Dingen des Alltags! Ob du berechnest, wie viele Fliesen ins Bad passen, wie viel Farbe du für die Wände brauchst oder welches Klimagerät in dein Zimmer passt – alles ist Geometrie.<br>Wenn du sie einmal verstanden hast, siehst du sie überall!",
    "landing-intro": "🔎 Wähle unten eine Figur und gib ihre Maße ein, um sofort Ergebnisse zu erhalten. Die Berechnungen werden automatisch in deiner Sprache angezeigt.<br>Du kannst auch über das <strong>obere Menü</strong> navigieren.",

    "perimeter": "Umfang",
    "area": "Fläche",
    "surface-area": "Oberfläche",
    "volume": "Volumen",
    "units": "Einheiten",
    "radius": "Radius:",
    "side": "Seite (a):",
    "length": "Länge (l):",
    "width": "Breite (w):",
    "height": "Höhe (h):",
    "base": "Grundlinie (b):",
    "3dheight": "Höhe (H):",
    "pyr-height": "Pyramidenhöhe (H):",
    "apothem": "Apothem (ap):",
    "major-axis": "Große Halbachse (a):",
    "minor-axis": "Kleine Halbachse (b):",
    "diagonal-1": "Diagonale 1 (d₁):",
    "diagonal-2": "Diagonale 2 (d₂):",
    "base-area": "Grundfläche (A):",
    "base-perimeter": "Grundlinien-Umfang (P):",
    "slant-height": "Schiefe Höhe (l):",

    "square": "Quadrat",
    "rhombus": "Raute",
    "parallelogram": "Parallelogramm",
    "cube": "Würfel",
    "rect": "Rechteck",
    "rect-prism": "Rechteckprisma",
    "triangle": "Dreieck",
    "triangle-right": "Rechtwinkliges Dreieck",
    "triangle-iso": "Gleichschenkliges Dreieck",
    "triangle-equi": "Gleichseitiges Dreieck",
    "triangle-family": "Dreiecks-Familie",
    "triangle-pyramid": "Dreieckspyramide (Tetraeder)",
    "circle": "Kreis",
    "pentagon": "Fünfeck",
    "hexagon": "Sechseck",
    "ngon": "Regelmäßiges n-Eck",
    "ellipse": "Ellipse",
    "sphere": "Kugel",
    "cylinder": "Zylinder",
    "cone": "Kegel",
    "generic-prism": "Allgemeines gerades Prisma",
    "oblique-prism": "Allgemeines schiefes Prisma",
    "generic-pyramid": "Allgemeine gerade Pyramide",
    "oblique-pyramid": "Allgemeine schiefe Pyramide",

    "suggestion-banner": "💡 Hilf mir, besser zu werden – hast du Feedback?",
    "send-here": "Hier senden",
    "not-implemented": "N/V",

    "desc-square": "Ein Quadrat hat vier gleich lange Seiten und rechte Winkel. Damit lässt sich Fläche und Umfang leicht berechnen.",
    "desc-rhombus": "Eine Raute hat vier gleich lange Seiten, aber schräge Winkel. Man erkennt sie oft in Mustern oder auf Drachen.",
    "desc-parallelogram": "Ein Parallelogramm hat gegenüberliegende, gleich lange und parallele Seiten – wie ein geneigtes Rechteck.",
    "desc-cube": "Ein Würfel ist eine 3D-Form mit sechs gleichen quadratischen Flächen. Damit berechnet man Volumen und Oberfläche.",
    "desc-rect": "Ein Rechteck hat gegenüberliegende, gleich lange Seiten. Mit Länge und Breite findest du Fläche und Umfang.",
    "desc-rect-prism": "Ein rechteckiges Prisma ist ein quaderförmiger Körper. Mit Länge, Breite und Höhe berechnet man Volumen und Oberfläche.",
    "desc-triangle": "Ein Dreieck hat drei Seiten. Mit Grundlinie und Höhe berechnet man schnell die Fläche.",
    "desc-triangle-right": "Ein rechtwinkliges Dreieck hat einen 90°-Winkel. Es steht im Zentrum des Satzes des Pythagoras.",
    "desc-triangle-iso": "Ein gleichschenkliges Dreieck hat zwei gleich lange Seiten – einfache Symmetrie.",
    "desc-triangle-equi": "Ein gleichseitiges Dreieck hat alle Seiten und Winkel gleich – reine geometrische Harmonie.",
    "desc-triangle-pyramid": "Eine Dreieckspyramide hat eine dreieckige Basis und drei seitliche Dreiecksflächen. Das Volumen lässt sich leicht berechnen.",
    "desc-circle": "Ein Kreis ist eine 2D-Form mit konstantem Radius. Fläche und Umfang ergeben sich direkt.",
    "desc-pentagon": "Ein Fünfeck hat fünf gleiche Seiten und Winkel – der Einstieg in die regelmäßigen Vielecke.",
    "desc-hexagon": "Ein Sechseck hat sechs gleiche Seiten – die Lieblingsform der Natur, sichtbar in Bienenwaben und Kristallen.",
    "desc-ngon": "Regelmäßige Vielecke mit vielen Seiten ähneln immer mehr einem Kreis – je mehr Seiten, desto glatter.",
    "desc-ellipse": "Eine Ellipse ist ein gestreckter Kreis, definiert durch zwei Halbachsen.",
    "desc-sphere": "Eine Kugel ist eine perfekt runde 3D-Form. Mit dem Radius berechnet man Fläche und Volumen.",
    "desc-cylinder": "Ein Zylinder hat zwei kreisförmige Basen und eine Höhe. Damit lassen sich Oberfläche und Volumen leicht finden.",
    "desc-cone": "Ein Kegel hat eine kreisförmige Basis und läuft in einer Spitze zusammen. Fläche und Volumen hängen von Radius und Höhe ab.",
    "desc-generic-prism": "Ein Prisma kann jede beliebige polygonale Basis haben. Wenn man die Grundfläche kennt, lässt sich das Volumen berechnen.",
    "desc-oblique-prism": "Ein schiefes Prisma hat dieselbe Basis wie ein gerades, ist aber geneigt – seine Seiten sind Parallelogramme.",
    "desc-generic-pyramid": "Jede Pyramide folgt demselben Prinzip: mit Basisfläche und Höhe berechnet man das Volumen.",
    "desc-oblique-pyramid": "Eine schiefe Pyramide hat eine versetzte Spitze – das Volumen bleibt gleich, aber die Oberfläche ist schwerer zu bestimmen.",

    "desc-perimeter": "<strong>Umfang:</strong> die Gesamtlänge um eine Figur herum. Addiere alle Seiten.",
    "desc-area": "<strong>Fläche:</strong> der innere Bereich einer 2D-Form. Jede Figur hat ihre eigene Formel.",
    "desc-volume": "<strong>Volumen:</strong> misst den Raum, den ein 3D-Körper einnimmt, in Kubikeinheiten.",
    "desc-surface-area": "<strong>Oberfläche:</strong> die Summe der Flächen aller Seiten eines Körpers.",

    "definitions": "Definitionen",

    "nav-home": "Startseite",
    "nav-about": "Über",
    "nav-privacy": "Datenschutz",
    "nav-contact": "Kontakt",
    "nav-feedback": "💡 Rückmeldung",
    "nav-terms": "Bedingungen",

    "footer-rights": "Alle Rechte vorbehalten.",
    "contact-title": "Kontakt",
    "contact-p1": "Hast du Vorschläge oder Feedback? Ich freue mich darüber.",
    "contact-p2": "Benutze den Feedback-Button oben, um eine Nachricht über Google Forms zu senden.",
    "contact-p3": "Ich lese alles, auch wenn ich nicht immer antworten kann. Danke, dass du 123Trig besser machst!",

    "privacy-title": "Datenschutzerklärung",
    "privacy-p1": "Wir erfassen keine persönlichen Daten direkt.",
    "privacy-p2": "Google AdSense kann Cookies verwenden, um Anzeigen zu personalisieren. Lies die Richtlinie von Google für weitere Informationen.",

    "about-title": "Über",
    "about-p1": "123Trig ist ein kostenloser visueller Rechner, der Schülern hilft, Geometrieprobleme schnell zu verstehen und zu lösen. Entstanden aus Frustration über unnötig komplizierte Formeln.",
    "about-p2": "Ich wollte etwas Praktisches, Logisches und Einfaches schaffen – ein klares, schnelles Werkzeug ohne Ablenkungen.",
    "about-p3": "Willst du das Ergebnis? Da ist es. Formel vergessen? Hier steht sie. 123Trig wurde entwickelt, um Reibung zu vermeiden: schneller rechnen, visuell lernen und weitermachen.",

    "terms-title": "Nutzungsbedingungen",
    "terms-p1": "123Trig ist ein kostenloses Lernwerkzeug. Nutzung auf eigene Verantwortung.",
    "terms-p2": "Wir bemühen uns um Genauigkeit, übernehmen aber keine Garantie für völlige Fehlerfreiheit.",
    "terms-p3": "Mit der Nutzung dieser Website erklärst du dich einverstanden, sie nicht für illegale oder schädliche Zwecke zu verwenden.",

    "section-2d": "🟪 Das 2D-Universum – oder Flachland!",
    "section-2d-desc": "Willkommen im Flachland: eine Welt mit nur Länge und Breite, ohne Tiefe! Hier beginnt die Geometrie – die Welt der Zeichnungen, Fliesen und Baupläne.",
    "section-3d": "🌐 Das 3D-Universum – der Raum wartet!",
    "section-3d-desc": "Tritt ein in die Welt der Tiefe, Höhe und Breite – wo Geometrie lebendig wird! Erkunde Würfel, Prismen, Zylinder, Kegel und Kugeln.",

    "menu-handle": "MENÜ",
    "menu-top": "Oben",
    "menu-2d": "2D-Figuren",
    "menu-3d": "3D-Körper"
},

  "it": {
    "main-title": "123Trig",
    "tagline": "Il tuo compagno di trigonometria — impara e calcola velocemente con strumenti visivi.",
    "subtitle": "Impara e calcola aree, volumi e perimetri delle figure geometriche in pochi secondi.<br>123Trig è uno strumento visivo gratuito e multilingue — ideale per studenti delle scuole medie e superiori.",
    "personal-take": "<strong>Breve introduzione:</strong><br>La geometria non è solo disegni su carta — è il segreto dietro tante cose della vita quotidiana! Dalla quantità di piastrelle necessarie per il bagno, alla vernice per le pareti, o persino alla scelta del condizionatore giusto per la tua stanza — tutto è geometria.<br>Una volta capita, la vedrai ovunque!",
    "landing-intro": "🔎 Seleziona una figura qui sotto e inserisci le dimensioni per ottenere risultati immediati. I calcoli si aggiornano automaticamente nella tua lingua.<br>Puoi anche navigare tramite il <strong>menu in alto</strong>.",

    "perimeter": "Perimetro",
    "area": "Area",
    "surface-area": "Superficie",
    "volume": "Volume",
    "units": "unità",
    "radius": "Raggio:",
    "side": "Lato (a):",
    "length": "Lunghezza (l):",
    "width": "Larghezza (w):",
    "height": "Altezza (h):",
    "base": "Base (b):",
    "3dheight": "Altezza (H):",
    "pyr-height": "Altezza della piramide (H):",
    "apothem": "Apotema (ap):",
    "major-axis": "Semiasse maggiore (a):",
    "minor-axis": "Semiasse minore (b):",
    "diagonal-1": "Diagonale 1 (d₁):",
    "diagonal-2": "Diagonale 2 (d₂):",
    "base-area": "Area della base (A):",
    "base-perimeter": "Perimetro della base (P):",
    "slant-height": "Altezza inclinata (l):",

    "square": "Quadrato",
    "rhombus": "Rombo",
    "parallelogram": "Parallelogramma",
    "cube": "Cubo",
    "rect": "Rettangolo",
    "rect-prism": "Prisma rettangolare",
    "triangle": "Triangolo",
    "triangle-right": "Triangolo rettangolo",
    "triangle-iso": "Triangolo isoscele",
    "triangle-equi": "Triangolo equilatero",
    "triangle-family": "Famiglia dei triangoli",
    "triangle-pyramid": "Piramide triangolare (tetraedro)",
    "circle": "Cerchio",
    "pentagon": "Pentagono",
    "hexagon": "Esagono",
    "ngon": "Poligono regolare (n-gon)",
    "ellipse": "Ellisse",
    "sphere": "Sfera",
    "cylinder": "Cilindro",
    "cone": "Cono",
    "generic-prism": "Prisma retto generico",
    "oblique-prism": "Prisma obliquo generico",
    "generic-pyramid": "Piramide retta generica",
    "oblique-pyramid": "Piramide obliqua generica",

    "suggestion-banner": "💡 Aiutami a migliorare — hai un suggerimento?",
    "send-here": "Invialo qui",
    "not-implemented": "N/A",

    "desc-square": "Un quadrato ha quattro lati uguali e angoli retti. Usalo per calcolare area e perimetro facilmente.",
    "desc-rhombus": "Un rombo ha quattro lati uguali ma angoli inclinati. È la classica forma a diamante presente in molti motivi decorativi.",
    "desc-parallelogram": "Un parallelogramma ha i lati opposti uguali e paralleli — come un rettangolo inclinato.",
    "desc-cube": "Un cubo è una figura tridimensionale con sei facce quadrate uguali. Permette di calcolare volume e superficie.",
    "desc-rect": "Un rettangolo ha lati opposti uguali. Con lunghezza e larghezza puoi ottenere area e perimetro.",
    "desc-rect-prism": "Un prisma rettangolare è un solido a forma di scatola. Usa le sue dimensioni per calcolare superficie e volume.",
    "desc-triangle": "Un triangolo ha tre lati. Con base e altezza puoi calcolarne rapidamente l’area.",
    "desc-triangle-right": "Un triangolo rettangolo ha un angolo di 90°. È alla base del Teorema di Pitagora e di molte strutture reali.",
    "desc-triangle-iso": "Un triangolo isoscele ha due lati uguali e un aspetto simmetrico — semplice e armonioso.",
    "desc-triangle-equi": "Un triangolo equilatero ha tutti i lati e gli angoli uguali — pura armonia geometrica.",
    "desc-triangle-pyramid": "Una piramide triangolare ha una base triangolare e tre facce laterali triangolari. Il volume si calcola facilmente.",
    "desc-circle": "Un cerchio è una figura piana con raggio costante. Area e perimetro si trovano con una sola formula.",
    "desc-pentagon": "Un pentagono ha cinque lati e angoli uguali — il primo passo nel mondo dei poligoni regolari.",
    "desc-hexagon": "Un esagono ha sei lati uguali — la forma preferita della natura, visibile nei favi e nei cristalli.",
    "desc-ngon": "I poligoni regolari con molti lati iniziano a somigliare a un cerchio: più lati, più la figura appare liscia.",
    "desc-ellipse": "Un’ellisse è un cerchio allungato definito da due semiassi.",
    "desc-sphere": "Una sfera è una forma tridimensionale perfettamente rotonda. Usa il raggio per calcolare area e volume.",
    "desc-cylinder": "Un cilindro ha due basi circolari e un’altezza. Calcola superficie e volume con facilità.",
    "desc-cone": "Un cono ha una base circolare e termina in un vertice. L’area e il volume dipendono dal raggio e dall’altezza.",
    "desc-generic-prism": "Un prisma costruito su una base poligonale qualsiasi. Conoscendo l’area della base, puoi calcolare il volume.",
    "desc-oblique-prism": "Un prisma obliquo ha la stessa base di un prisma retto ma è inclinato — le facce laterali sono parallelogrammi.",
    "desc-generic-pyramid": "Ogni piramide segue la stessa logica: conoscendo area della base e altezza, ottieni il volume.",
    "desc-oblique-pyramid": "Una piramide obliqua ha il vertice spostato — il volume resta uguale, ma la superficie va calcolata sommando ogni faccia triangolare.",

    "desc-perimeter": "<strong>Perimetro:</strong> somma di tutti i lati che circondano una figura. Misura il contorno.",
    "desc-area": "<strong>Area:</strong> spazio interno di una figura piana. Ogni forma ha la propria formula.",
    "desc-volume": "<strong>Volume:</strong> misura lo spazio occupato da un solido, espresso in unità cubiche.",
    "desc-surface-area": "<strong>Superficie:</strong> somma delle aree di tutte le facce di un solido.",

    "definitions": "Definizioni",

    "nav-home": "Home",
    "nav-about": "Chi siamo",
    "nav-privacy": "Privacy",
    "nav-contact": "Contatto",
    "nav-feedback": "💡 Suggerimenti",
    "nav-terms": "Termini",

    "footer-rights": "Tutti i diritti riservati.",
    "contact-title": "Contatto",
    "contact-p1": "Hai suggerimenti o commenti? Mi farebbe piacere leggerli.",
    "contact-p2": "Usa il pulsante di feedback in alto per inviare un messaggio tramite Google Forms.",
    "contact-p3": "Leggo tutto, anche se non sempre posso rispondere. Grazie per aiutare a migliorare 123Trig.",

    "privacy-title": "Informativa sulla privacy",
    "privacy-p1": "Non raccogliamo dati personali direttamente.",
    "privacy-p2": "Google AdSense può utilizzare cookie per personalizzare gli annunci. Consulta la politica di Google per ulteriori informazioni.",

    "about-title": "Informazioni",
    "about-p1": "123Trig è una calcolatrice visiva gratuita progettata per aiutare gli studenti a comprendere e risolvere rapidamente problemi di geometria. È nata da una frustrazione personale: vedere studenti confondersi con formule più complicate del necessario.",
    "about-p2": "Volevo creare qualcosa di pratico, logico e semplice — uno strumento chiaro, veloce e senza distrazioni.",
    "about-p3": "Vuoi il risultato? Eccolo. Hai dimenticato la formula? È qui. 123Trig è pensato per eliminare le difficoltà: calcola più rapidamente, impara visivamente e vai avanti.",

    "terms-title": "Termini di servizio",
    "terms-p1": "123Trig è uno strumento educativo gratuito. Usalo a tua discrezione.",
    "terms-p2": "Puntiamo alla precisione, ma non possiamo garantire che tutti i risultati siano privi di errori.",
    "terms-p3": "Utilizzando questo sito, accetti di non impiegarlo per scopi illegali o dannosi.",

    "section-2d": "🟪 L’universo 2D — o Pianolandia!",
    "section-2d-desc": "Benvenuto a Pianolandia: un mondo con solo lunghezza e larghezza, senza profondità! È qui che inizia la geometria — il regno dei disegni, delle piastrelle e delle planimetrie.",
    "section-3d": "🌐 L’universo 3D — lo spazio ti aspetta!",
    "section-3d-desc": "Entra nel mondo della profondità, dell’altezza e della larghezza — dove la geometria prende vita! Esplora cubi, prismi, cilindri, coni e sfere.",

    "menu-handle": "MENU",
    "menu-top": "Inizio",
    "menu-2d": "Figure 2D",
    "menu-3d": "Solidi 3D"
},
"zh": {
  "main-title": "123Trig",
  "tagline": "你的三角学伙伴 —— 用视觉工具快速学习与计算。",
  "subtitle": "几秒钟内学习并计算几何图形的面积、体积和周长。<br>123Trig 是一个免费、多语言的可视化工具 —— 专为初中和高中学生设计。",
  "personal-take": "<strong>小引言：</strong><br>几何不仅仅是纸上的图形 —— 它是我们日常生活背后的秘密！从计算浴室需要多少瓷砖，到粉刷墙壁的油漆量，甚至选择合适的空调 —— 一切都离不开几何。<br>一旦理解了，你会在生活中处处看到它！",
  "landing-intro": "🔎 选择下方的图形并输入尺寸，即可立即获得结果。计算会自动以你的语言显示。<br>你也可以使用 <strong>顶部菜单</strong> 进行导航。",

  "perimeter": "周长",
  "area": "面积",
  "surface-area": "表面积",
  "volume": "体积",
  "units": "单位",
  "radius": "半径：",
  "side": "边 (a)：",
  "length": "长度 (l)：",
  "width": "宽度 (w)：",
  "height": "高度 (h)：",
  "base": "底边 (b)：",
  "3dheight": "高度 (H)：",
  "pyr-height": "金字塔高度 (H)：",
  "apothem": "中垂线 (ap)：",
  "major-axis": "长半轴 (a)：",
  "minor-axis": "短半轴 (b)：",
  "diagonal-1": "对角线1 (d₁)：",
  "diagonal-2": "对角线2 (d₂)：",
  "base-area": "底面积 (A)：",
  "base-perimeter": "底边周长 (P)：",
  "slant-height": "斜高 (l)：",

  "square": "正方形",
  "rhombus": "菱形",
  "parallelogram": "平行四边形",
  "cube": "立方体",
  "rect": "长方形",
  "rect-prism": "长方体",
  "triangle": "三角形",
  "triangle-right": "直角三角形",
  "triangle-iso": "等腰三角形",
  "triangle-equi": "等边三角形",
  "triangle-family": "三角形家族",
  "triangle-pyramid": "三角锥体 (四面体)",
  "circle": "圆形",
  "pentagon": "五边形",
  "hexagon": "六边形",
  "ngon": "正n边形",
  "ellipse": "椭圆",
  "sphere": "球体",
  "cylinder": "圆柱体",
  "cone": "圆锥体",
  "generic-prism": "一般直棱柱",
  "oblique-prism": "一般斜棱柱",
  "generic-pyramid": "一般直锥体",
  "oblique-pyramid": "一般斜锥体",

  "suggestion-banner": "💡 帮我改进 — 有什么建议吗？",
  "send-here": "点此发送",
  "not-implemented": "暂不支持",

  "desc-square": "正方形有四条相等的边和直角。用它可以轻松计算面积和周长。",
  "desc-rhombus": "菱形有四条相等的边，但角度倾斜。它常出现在装饰图案或风筝中。",
  "desc-parallelogram": "平行四边形的对边相等且平行 —— 像一个被推斜的长方形。",
  "desc-cube": "立方体是六个正方形面组成的三维形体，可计算体积和表面积。",
  "desc-rect": "长方形的对边相等。只需长度和宽度即可求面积和周长。",
  "desc-rect-prism": "长方体是箱状的三维物体。利用长、宽、高可求表面积和体积。",
  "desc-triangle": "三角形有三条边。用底和高即可快速求面积。",
  "desc-triangle-right": "直角三角形有一个90°角，是勾股定理的基础形状。",
  "desc-triangle-iso": "等腰三角形有两条相等的边，形状对称，结构稳定。",
  "desc-triangle-equi": "等边三角形三边相等、三角相等 —— 纯粹的几何对称。",
  "desc-triangle-pyramid": "三角锥体有一个三角形底面和三条侧面，易于计算体积。",
  "desc-circle": "圆是半径恒定的二维图形。面积和周长的计算非常直接。",
  "desc-pentagon": "五边形有五条相等的边和角 —— 是规则多边形的入门形。",
  "desc-hexagon": "六边形有六条相等的边，是自然界常见的形状，如蜂巢。",
  "desc-ngon": "当边数增多时，正多边形会越来越接近圆形。",
  "desc-ellipse": "椭圆是由长半轴和短半轴定义的拉伸圆形。",
  "desc-sphere": "球体是完全对称的三维形体。通过半径即可求表面积和体积。",
  "desc-cylinder": "圆柱体有两个圆形底面和一个高度。可求体积与表面积。",
  "desc-cone": "圆锥体有一个圆形底面并逐渐收尖至顶点。面积和体积取决于半径与高度。",
  "desc-generic-prism": "任何多边形为底面的棱柱都遵循相同规律：知道底面积即可求体积。",
  "desc-oblique-prism": "斜棱柱的底面与直棱柱相同，只是侧面倾斜，呈平行四边形。",
  "desc-generic-pyramid": "所有锥体都遵循相同逻辑：底面积乘以高度再除以3即可得体积。",
  "desc-oblique-pyramid": "斜锥体的顶点偏移。体积不变，但表面积计算更复杂。",

  "desc-perimeter": "<strong>周长：</strong> 围绕图形的总长度。将所有边相加即可。",
  "desc-area": "<strong>面积：</strong> 图形内部的空间。每种形状都有相应公式。",
  "desc-volume": "<strong>体积：</strong> 三维物体所占空间，用立方单位表示。",
  "desc-surface-area": "<strong>表面积：</strong> 三维物体所有外表面的总面积。",

  "definitions": "定义",

  "nav-home": "首页",
  "nav-about": "关于",
  "nav-privacy": "隐私",
  "nav-contact": "联系",
  "nav-feedback": "💡 意见反馈",
  "nav-terms": "条款",

  "footer-rights": "版权所有。",
  "contact-title": "联系",
  "contact-p1": "有建议或反馈吗？我很乐意倾听。",
  "contact-p2": "请使用上方的反馈按钮，通过 Google 表单发送消息。",
  "contact-p3": "我会阅读所有留言，即使不能逐一回复。感谢帮助改进 123Trig。",

  "privacy-title": "隐私政策",
  "privacy-p1": "我们不会直接收集任何个人数据。",
  "privacy-p2": "Google AdSense 可能会使用 Cookie 个性化广告。详情请查看 Google 隐私政策。",

  "about-title": "关于",
  "about-p1": "123Trig 是一个免费的可视化几何计算器，帮助学生快速理解并解决几何问题。它源于一个简单的想法：让公式更直观、更易用。",
  "about-p2": "我想创建一个实用、逻辑清晰且简洁的工具 —— 专注于理解和结果，而非复杂性。",
  "about-p3": "想要结果？点一下就有。忘了公式？它就在这里。123Trig 旨在消除障碍，让学习更直观、更高效。",

  "terms-title": "服务条款",
  "terms-p1": "123Trig 是一个免费的教育工具。请自行决定如何使用。",
  "terms-p2": "我们尽力确保计算准确，但不保证结果完全无误。",
  "terms-p3": "使用本网站即表示你同意不将其用于违法或恶意目的。",

  "section-2d": "🟪 二维宇宙 —— 平面世界！",
  "section-2d-desc": "欢迎来到平面世界：一个只有长度和宽度、没有深度的地方！这里是几何的起点 —— 图纸、瓷砖和设计的领域。",
  "section-3d": "🌐 三维宇宙 —— 空间在召唤！",
  "section-3d-desc": "进入有深度、高度和宽度的世界 —— 几何在这里焕发生命！探索立方体、棱柱、圆柱、圆锥和球体。",

  "menu-handle": "菜单",
  "menu-top": "顶部",
  "menu-2d": "二维图形",
  "menu-3d": "三维立体"
},
"ja": {
  "main-title": "123Trig",
  "tagline": "あなたの三角学パートナー — 視覚ツールで素早く学び、計算しよう。",
  "subtitle": "数秒で図形の面積、体積、周囲の長さを学び、計算しよう。<br>123Trig は無料で多言語対応のビジュアルツールです。中学生・高校生に最適です。",
  "personal-take": "<strong>ちょっとした紹介：</strong><br>幾何学はただの図形ではありません。日常のあらゆるところにあります！お風呂のタイルの枚数を数えるとき、壁を塗るペンキの量を計算するとき、部屋に合うエアコンを選ぶとき — すべてが幾何学です。<br>一度わかれば、もう世界が違って見えます！",
  "landing-intro": "🔎 下の図形を選び、寸法を入力するとすぐに結果が表示されます。計算は自動的に日本語で更新されます。<br><strong>上部メニュー</strong> からも操作できます。",

  "perimeter": "周の長さ",
  "area": "面積",
  "surface-area": "表面積",
  "volume": "体積",
  "units": "単位",
  "radius": "半径：",
  "side": "辺 (a)：",
  "length": "長さ (l)：",
  "width": "幅 (w)：",
  "height": "高さ (h)：",
  "base": "底辺 (b)：",
  "3dheight": "高さ (H)：",
  "pyr-height": "ピラミッドの高さ (H)：",
  "apothem": "アポセム (ap)：",
  "major-axis": "長軸 (a)：",
  "minor-axis": "短軸 (b)：",
  "diagonal-1": "対角線1 (d₁)：",
  "diagonal-2": "対角線2 (d₂)：",
  "base-area": "底面積 (A)：",
  "base-perimeter": "底面の周の長さ (P)：",
  "slant-height": "斜高 (l)：",

  "square": "正方形",
  "rhombus": "ひし形",
  "parallelogram": "平行四辺形",
  "cube": "立方体",
  "rect": "長方形",
  "rect-prism": "直方体",
  "triangle": "三角形",
  "triangle-right": "直角三角形",
  "triangle-iso": "二等辺三角形",
  "triangle-equi": "正三角形",
  "triangle-family": "三角形ファミリー",
  "triangle-pyramid": "三角錐 (四面体)",
  "circle": "円",
  "pentagon": "五角形",
  "hexagon": "六角形",
  "ngon": "正n角形",
  "ellipse": "楕円",
  "sphere": "球体",
  "cylinder": "円柱",
  "cone": "円錐",
  "generic-prism": "一般の直柱体",
  "oblique-prism": "一般の斜柱体",
  "generic-pyramid": "一般の直錐体",
  "oblique-pyramid": "一般の斜錐体",

  "suggestion-banner": "💡 改善のための提案はありますか？",
  "send-here": "こちらへ送信",
  "not-implemented": "未対応",

  "desc-square": "正方形は4つの等しい辺と直角を持つ図形です。面積や周の長さを簡単に計算できます。",
  "desc-rhombus": "ひし形は4辺が等しいですが、角が傾いています。装飾やたこなどによく見られます。",
  "desc-parallelogram": "平行四辺形は対辺が平行で等しい形です。少し傾いた長方形のようです。",
  "desc-cube": "立方体は6つの正方形の面からなる3Dの立体です。体積や表面積を求められます。",
  "desc-rect": "長方形は対辺が等しい形です。縦と横がわかれば面積と周の長さが出せます。",
  "desc-rect-prism": "直方体は箱のような形の立体です。縦・横・高さから体積や表面積を計算します。",
  "desc-triangle": "三角形は3つの辺を持つ図形です。底辺と高さで面積が求められます。",
  "desc-triangle-right": "直角三角形は1つの角が90°です。ピタゴラスの定理の基本形です。",
  "desc-triangle-iso": "二等辺三角形は2辺が等しく、左右対称な形をしています。",
  "desc-triangle-equi": "正三角形は3辺と3角がすべて等しい、完全な対称形です。",
  "desc-triangle-pyramid": "三角錐は三角形の底面と3つの側面を持ちます。体積を簡単に求められます。",
  "desc-circle": "円は半径が一定の2D図形です。面積と円周は簡単に計算できます。",
  "desc-pentagon": "五角形は5つの等しい辺と角を持つ、基本的な正多角形です。",
  "desc-hexagon": "六角形は6辺が等しい形で、自然界ではハチの巣などに見られます。",
  "desc-ngon": "正多角形の辺の数が増えるほど、形は円に近づいていきます。",
  "desc-ellipse": "楕円は2つの半軸によって定義される引き伸ばされた円です。",
  "desc-sphere": "球体は完全に対称な3D形状です。半径から表面積と体積を求めます。",
  "desc-cylinder": "円柱は2つの円形の底面と高さを持つ立体です。体積や表面積を簡単に計算できます。",
  "desc-cone": "円錐は円形の底面と1つの頂点を持つ立体です。半径と高さから体積と面積を求めます。",
  "desc-generic-prism": "どんな多角形を底面にしても、柱体の体積は「底面積×高さ」で求められます。",
  "desc-oblique-prism": "斜柱体は底面が平行でも、側面が傾いている柱体です。体積は同じ式で求められます。",
  "desc-generic-pyramid": "どんな形の底面でも、錐体の体積は「底面積×高さ÷3」です。",
  "desc-oblique-pyramid": "斜錐体は頂点がずれている錐体です。体積は変わらず、表面積の計算が少し複雑です。",

  "desc-perimeter": "<strong>周の長さ：</strong> 図形を囲む全ての辺の合計です。",
  "desc-area": "<strong>面積：</strong> 図形の内部の広さを表します。各図形に対応する公式があります。",
  "desc-volume": "<strong>体積：</strong> 立体が占める空間の大きさ。立方単位で表されます。",
  "desc-surface-area": "<strong>表面積：</strong> 立体のすべての面の面積の合計です。",

  "definitions": "定義",

  "nav-home": "ホーム",
  "nav-about": "概要",
  "nav-privacy": "プライバシー",
  "nav-contact": "お問い合わせ",
  "nav-feedback": "💡 フィードバック",
  "nav-terms": "利用規約",

  "footer-rights": "すべての権利を保有します。",
  "contact-title": "お問い合わせ",
  "contact-p1": "ご意見・ご提案があれば、ぜひお聞かせください。",
  "contact-p2": "上部のフィードバックボタンから Google フォームで送信できます。",
  "contact-p3": "すべてのメッセージを読んでいます。返信できない場合もありますが、ご協力ありがとうございます。",

  "privacy-title": "プライバシーポリシー",
  "privacy-p1": "当サイトでは個人情報を直接収集しません。",
  "privacy-p2": "Google AdSense は Cookie を使用して広告をパーソナライズする場合があります。詳細は Google のポリシーをご確認ください。",

  "about-title": "概要",
  "about-p1": "123Trig は、学生が幾何の問題を素早く理解し、解くのを助ける無料のビジュアル計算ツールです。複雑な公式をもっとわかりやすくするために作られました。",
  "about-p2": "シンプルで論理的、そして実用的なツールを目指しています。余計な装飾はなく、明快さと結果に集中しています。",
  "about-p3": "結果が知りたい？ここにあります。公式を忘れた？すぐ見つかります。123Trig は学びをスムーズにするためのツールです。",

  "terms-title": "利用規約",
  "terms-p1": "123Trig は無料の教育ツールです。自己責任でご利用ください。",
  "terms-p2": "正確性を目指していますが、すべての結果が完全に正しいことを保証するものではありません。",
  "terms-p3": "本サイトを違法または悪意ある目的で使用しないことに同意します。",

  "section-2d": "🟪 2Dの世界 — フラットランド！",
  "section-2d-desc": "ようこそフラットランドへ！ここは長さと幅だけの世界。深さはありません。幾何学の出発点です。",
  "section-3d": "🌐 3Dの世界 — 空間へようこそ！",
  "section-3d-desc": "奥行き・高さ・幅がある世界へ進もう。ここでは幾何が生きています！立方体、柱体、円柱、円錐、球体を探検しよう。",

  "menu-handle": "メニュー",
  "menu-top": "トップ",
  "menu-2d": "2D図形",
  "menu-3d": "3D立体"
}



}
