{
  "en": {
    "main-title": "123Trig",
    "tagline": "Your Trigonometry Pal — learn and calculate fast with visual tools.",
    "subtitle": "Learn and calculate areas, volumes, and perimeters of geometric figures in seconds. 123Trig is a free, multilingual visual tool — ideal for middle and high school students.",
    "landing-intro": "🔎 Select a shape below and enter its dimensions to get instant results. Calculations update automatically in your language.",
    "perimeter": "Perimeter",
    "area": "Area",
    "surface-area": "Surface Area",
    "volume": "Volume",
    "units": "units",
    "radius": "Radius:",
    "side": "Side(a):",
    "length": "Length (l):",
    "width": "Width (w):",
    "height": "Height (h):",
    "base": "Base (b):",
    "pyr-height": "Pyr Height (H):",
    "square": "Square",
    "cube": "Cube",
    "rect": "Rectangle",
    "rect-prism": "Rectangular Prism",
    "triangle": "Triangle",
    "triangle-pyramid": "Triangular Pyramid",
    "circle": "Circle",
    "sphere": "Sphere",
    "cylinder": "Cylinder",
    "cone": "Cone",
    "suggestion-banner": "💡 Help me get better — got feedback?",
    "send-here": "Send it here",
    "not-implemented": "Not calculable with current inputs",
    "desc-square": "A square has four equal sides and right angles. Use it to calculate area and perimeter easily.",
    "desc-cube": "A cube is a 3D shape with six equal square faces. It lets you compute volume and surface area.",
    "desc-rect": "A rectangle has opposite sides equal. Quickly find its area and perimeter with two sides.",
    "desc-rect-prism": "A rectangular prism is a box-shaped 3D object. Use it to find surface area and volume.",
    "desc-triangle": "A triangle has three sides. With base and height, you can get its area fast.",
    "desc-triangle-pyramid": "A triangular pyramid has a triangle base and three faces. You can calculate volume easily.",
    "desc-circle": "A circle is a 2D shape with constant radius. Compute its area and perimeter in one step.",
    "desc-sphere": "A sphere is a perfectly round 3D shape. Use its radius to get surface area and volume.",
    "desc-cylinder": "A cylinder has two circular faces and height. Get surface area and volume with simple inputs.",
    "desc-cone": "A cone has a circular base and tapers to a point. Quickly compute area and volume with radius and height.",
    "desc-perimeter": "<strong>Perimeter</strong> is the total length around a shape. It's easy to find for polygons.",
    "desc-area": "<strong>Area</strong> is the space inside a 2D shape. Each figure has a specific formula to calculate it.",
    "desc-volume": "<strong>Volume</strong> measures how much space a 3D shape takes. It's given in cubic units.",
    "desc-surface-area": "<strong>Surface area</strong> is the total area of all faces of a 3D object. Useful in geometry and real-world applications.",
    "definitions": "Definitions",
    "nav-home": "Home",
    "nav-about": "About",
    "nav-privacy": "Privacy",
    "nav-contact": "Contact",
    "nav-feedback": "💡 Feedback",
    "nav-terms": "Terms",
    "footer-rights": "All rights reserved.",
    "contact-title": "Contact",
    "contact-p1": "Have feedback or suggestions? I'd love to hear from you.",
    "contact-p2": "Use the feedback button at the top to send your message via Google Forms.",
    "contact-p3": "I read everything, even if I can't always reply. Thanks for helping improve 123Trig.",
    "privacy-title": "Privacy Policy",
    "privacy-p1": "We do not collect personal data directly.",
    "privacy-p2": "Google AdSense may use cookies to personalize ads. See Google’s policy for more info.",
    "about-title": "About",
    "about-p1": "123Trig is a free visual calculator designed to help students quickly understand and solve geometry problems. It was born out of a personal frustration: I often saw students struggling with formulas that felt more complicated than they needed to be.",
    "about-p2": "I wanted to create something pragmatic, logical, and simple — a clean, fast tool focused on clarity and results, not noise or distractions.",
    "about-p3": "Want the result? Go for it. Forgot the formula? It's right there. 123Trig was built to remove friction — so you can calculate faster, learn visually, and move on.",
    "terms-title": "Terms of Service",
    "terms-p1": "123Trig is a free educational tool. Use it at your own discretion.",
    "terms-p2": "While we aim for accuracy, we do not guarantee that all results are free of errors.",
    "terms-p3": "By using this site, you agree not to use it for unlawful or malicious purposes."
  },
  "es": {
    "main-title": "123Trig",
    "tagline": "Tu amigo en trigonometría — aprende y calcula rápido con herramientas visuales.",
    "subtitle": "Aprende y calcula áreas, volúmenes y perímetros de figuras geométricas en segundos. 123Trig es una herramienta visual, gratuita y multilingüe — ideal para estudiantes de secundaria y preparatoria.",
    "landing-intro": "🔎 Selecciona una figura y escribe sus medidas para ver los resultados al instante. Los cálculos se actualizan automáticamente en tu idioma.",
    "perimeter": "Perímetro",
    "area": "Área",
    "surface-area": "Área superficial",
    "volume": "Volumen",
    "units": "unidades",
    "radius": "Radio:",
    "side": "Lado(a):",
    "length": "Largo (l):",
    "width": "Ancho (w):",
    "height": "Altura (h):",
    "base": "Base (b):",
    "pyr-height": "Altura Pirámide (H):",
    "square": "Cuadrado",
    "cube": "Cubo",
    "rect": "Rectángulo",
    "rect-prism": "Prisma Rectangular",
    "triangle": "Triángulo",
    "triangle-pyramid": "Pirámide Triangular",
    "circle": "Círculo",
    "sphere": "Esfera",
    "cylinder": "Cilindro",
    "cone": "Cono",
    "suggestion-banner": "💡 Ayúdame a mejorar — ¿tienes sugerencias?",
    "send-here": "Envíalas aquí",
    "not-implemented": "No se puede calcular con estos datos",
    "definitions": "Definiciones",
    "desc-perimeter": "<strong>Perímetro</strong> es la longitud total alrededor de una figura. Suma todos sus lados.",
    "desc-area": "<strong>Área</strong> es el espacio dentro de una figura plana. Usa fórmulas como a² o base × altura.",
    "desc-volume": "<strong>Volumen</strong> mide cuánto espacio ocupa un objeto 3D. Piensa en cubos.",
    "desc-surface-area": "<strong>Área superficial</strong> es la suma del área de todas las caras de una figura 3D.",
    "desc-square": "Un cuadrado tiene 4 lados iguales y 4 ángulos rectos. Área = a².",
    "desc-cube": "Un cubo es un cuadrado en 3D. Todos sus lados y caras son iguales.",
    "desc-rect": "Un rectángulo tiene lados opuestos iguales y 4 ángulos rectos. Área = l × w.",
    "desc-rect-prism": "Un prisma rectangular tiene forma de caja con 6 caras rectangulares.",
    "desc-triangle": "Un triángulo tiene 3 lados. Área = base × altura ÷ 2.",
    "desc-triangle-pyramid": "Una pirámide triangular (tetraedro) tiene 4 caras triangulares.",
    "desc-circle": "Un círculo es una figura redonda definida por su radio.",
    "desc-sphere": "Una esfera es una figura perfectamente redonda en 3D. Como una pelota.",
    "desc-cylinder": "Un cilindro tiene dos bases circulares y lados rectos.",
    "desc-cone": "Un cono tiene una base circular y termina en un vértice.",
    "nav-home": "Inicio",
    "nav-about": "Acerca",
    "nav-privacy": "Privacidad",
    "nav-contact": "Contacto",
    "nav-feedback": "💡 Sugerencias",
    "nav-terms": "Términos",
    "footer-rights": "Todos los derechos reservados.",
    "contact-title": "Contacto",
    "contact-p1": "¿Tienes sugerencias o comentarios? Me encantaría escucharte.",
    "contact-p2": "Usa el botón de feedback arriba para enviar tu mensaje mediante Google Forms.",
    "contact-p3": "Leo todo, aunque no siempre pueda responder. Gracias por ayudar a mejorar 123Trig.",
    "privacy-title": "Política de Privacidad",
    "privacy-p1": "No recopilamos datos personales directamente.",
    "privacy-p2": "Google AdSense puede usar cookies para personalizar anuncios. Consulta la política de Google para más información.",
    "about-title": "Acerca de",
    "about-p1": "123Trig es una calculadora visual gratuita pensada para ayudar a estudiantes a entender y resolver problemas de geometría rápidamente. Nació por una frustración personal: veía cómo muchos estudiantes batallaban con fórmulas que parecían más complicadas de lo necesario.",
    "about-p2": "Quise crear algo pragmático, lógico y sencillo — una herramienta clara, directa y sin distracciones.",
    "about-p3": "¿Quieres el resultado? Adelante. ¿Olvidaste la fórmula? Ahí está. 123Trig fue creado para quitarte fricción: calcula más rápido, aprende visualmente y sigue con lo que sigue.",
    "terms-title": "Términos de Servicio",
    "terms-p1": "123Trig es una herramienta educativa gratuita. Úsala bajo tu propio criterio.",
    "terms-p2": "Aunque buscamos precisión, no garantizamos que todos los resultados estén libres de errores.",
    "terms-p3": "Al usar este sitio, aceptas no utilizarlo con fines ilícitos o malintencionados."
  },
  "fr": {
    "main-title": "123Trig",
    "tagline": "Ton pote en trigonométrie — apprends et calcule vite avec des outils visuels.",
    "subtitle": "Apprenez et calculez les aires, volumes et périmètres des figures géométriques en quelques secondes. 123Trig est un outil visuel gratuit et multilingue — idéal pour les élèves du collège et du lycée.",
    "landing-intro": "🔎 Choisissez une figure ci-dessous et entrez ses dimensions pour obtenir un résultat instantané. Les calculs s’adaptent automatiquement à votre langue.",
    "perimeter": "Périmètre",
    "area": "Surface",
    "surface-area": "Surface extérieure",
    "volume": "Volume",
    "units": "unités",
    "radius": "Rayon:",
    "side": "Côté(a):",
    "length": "Longueur (l):",
    "width": "Largeur (w):",
    "height": "Hauteur (h):",
    "base": "Base (b):",
    "pyr-height": "Hauteur Pyramide (H):",
    "square": "Carré",
    "cube": "Cube",
    "rect": "Rectangle",
    "rect-prism": "Prisme Rectangulaire",
    "triangle": "Triangle",
    "triangle-pyramid": "Pyramide Triangulaire",
    "circle": "Cercle",
    "sphere": "Sphère",
    "cylinder": "Cylindre",
    "cone": "Cône",
    "suggestion-banner": "💡 Aide-moi à m'améliorer — une idée ?",
    "send-here": "Envoie-la ici",
    "not-implemented": "Non calculable avec ces données",
    "definitions": "Définitions",
    "desc-perimeter": "<strong>Périmètre :</strong> longueur totale autour d’une figure plane. Additionne tous les côtés.",
    "desc-area": "<strong>Surface :</strong> espace à l’intérieur d’une figure 2D. Utilise des formules comme a² ou base × hauteur.",
    "desc-volume": "<strong>Volume :</strong> mesure l’espace occupé par un objet 3D. Imagine des cubes.",
    "desc-surface-area": "<strong>Surface extérieure :</strong> somme des surfaces de toutes les faces d’une figure 3D.",
    "desc-square": "Un carré a 4 côtés égaux et 4 angles droits. Aire = a².",
    "desc-cube": "Un cube est un carré en 3D. Toutes les arêtes et faces sont égales.",
    "desc-rect": "Un rectangle a des côtés opposés égaux et 4 angles droits. Aire = l × w.",
    "desc-rect-prism": "Un prisme rectangulaire est une boîte avec 6 faces rectangulaires.",
    "desc-triangle": "Un triangle a 3 côtés. Aire = base × hauteur ÷ 2.",
    "desc-triangle-pyramid": "Une pyramide triangulaire a 4 faces triangulaires.",
    "desc-circle": "Un cercle est une figure ronde définie par son rayon.",
    "desc-sphere": "Une sphère est une forme ronde en 3D. Comme une balle.",
    "desc-cylinder": "Un cylindre a deux bases circulaires et des côtés droits.",
    "desc-cone": "Un cône a une base circulaire et se termine en pointe.",
    "nav-home": "Accueil",
    "nav-about": "À propos",
    "nav-privacy": "Confidentialité",
    "nav-contact": "Contact",
    "nav-feedback": "💡 Suggestions",
    "nav-terms": "Conditions",
    "footer-rights": "Tous droits réservés.",
    "contact-title": "Contact",
    "contact-p1": "Des suggestions ou retours ? Je suis tout ouïe.",
    "contact-p2": "Utilisez le bouton feedback en haut pour envoyer un message via Google Forms.",
    "contact-p3": "Je lis tout, même si je ne peux pas toujours répondre. Merci d'aider à améliorer 123Trig.",
    "privacy-title": "Politique de Confidentialité",
    "privacy-p1": "123Trig ne collecte aucune donnée personnelle. Pas de cookies, de tracking ou de scripts d'analyse.",
    "privacy-p2": "Les formulaires de feedback sont gérés par Google Forms et soumis à leur politique de confidentialité.",
    "about-title": "À propos",
    "about-p1": "123Trig est une calculatrice visuelle gratuite conçue pour aider les élèves à comprendre et résoudre rapidement des problèmes de géométrie. Elle est née d’une frustration personnelle : je voyais souvent des élèves galérer avec des formules inutilement compliquées.",
    "about-p2": "Je voulais créer un outil pragmatique, logique et simple — rapide, clair et sans distractions.",
    "about-p3": "Tu veux le résultat ? Le voilà. Tu as oublié la formule ? Elle est là. 123Trig vise à éliminer les frictions pour calculer plus vite, apprendre visuellement et avancer.",
    "terms-title": "Conditions d’Utilisation",
    "terms-p1": "123Trig est un outil éducatif gratuit. Utilisez-le à votre propre discrétion.",
    "terms-p2": "Nous visons l’exactitude, mais ne garantissons pas que tous les résultats soient exempts d’erreurs.",
    "terms-p3": "En utilisant ce site, vous acceptez de ne pas l’utiliser à des fins illégales ou malveillantes."
  },
  "pt": {
    "main-title": "123Trig",
    "tagline": "Seu parceiro de trigonometria — aprenda e calcule rápido com ferramentas visuais.",
    "subtitle": "Aprenda e calcule áreas, volumes e perímetros de figuras geométricas em segundos. 123Trig é uma ferramenta visual gratuita e multilíngue — ideal para estudantes do ensino fundamental e médio.",
    "landing-intro": "🔎 Selecione uma figura abaixo e insira suas dimensões para obter resultados instantâneos. Os cálculos são atualizados automaticamente no seu idioma.",
    "perimeter": "Perímetro",
    "area": "Área",
    "volume": "Volume",
    "units": "unidades",
    "radius": "Raio:",
    "side": "Lado(a):",
    "length": "Comprimento (l):",
    "width": "Largura (w):",
    "height": "Altura (h):",
    "base": "Base (b):",
    "pyr-height": "Altura da Pirâmide (H):",
    "square": "Quadrado",
    "cube": "Cubo",
    "rect": "Retângulo",
    "rect-prism": "Prisma Retangular",
    "triangle": "Triângulo",
    "triangle-pyramid": "Pirâmide Triangular",
    "circle": "Círculo",
    "sphere": "Esfera",
    "cylinder": "Cilindro",
    "cone": "Cone",
    "suggestion-banner": "💡 Ajude-me a melhorar — tem uma sugestão?",
    "send-here": "Envie aqui",
    "surface-area": "Área superficial",
    "not-implemented": "Não é possível calcular com esses dados",
    "definitions": "Definições",
    "desc-perimeter": "<strong>Perímetro</strong> é o comprimento total ao redor de uma figura. Some todos os lados.",
    "desc-area": "<strong>Área</strong> é o espaço dentro de uma figura 2D. Use fórmulas como a² ou base × altura.",
    "desc-volume": "<strong>Volume</strong> mede quanto espaço um objeto 3D ocupa. Pense em cubos.",
    "desc-surface-area": "<strong>Área superficial</strong> é a soma das áreas de todas as faces de um sólido.",
    "desc-square": "Um quadrado tem 4 lados iguais e 4 ângulos retos. Área = a².",
    "desc-cube": "Um cubo é um quadrado em 3D. Todos os lados e faces são iguais.",
    "desc-rect": "Um retângulo tem lados opostos iguais e 4 ângulos retos. Área = l × w.",
    "desc-rect-prism": "Um prisma retangular é como uma caixa com 6 faces retangulares.",
    "desc-triangle": "Um triângulo tem 3 lados. Área = base × altura ÷ 2.",
    "desc-triangle-pyramid": "Uma pirâmide triangular tem 4 faces triangulares.",
    "desc-circle": "Um círculo é uma figura redonda definida pelo raio.",
    "desc-sphere": "Uma esfera é uma figura perfeitamente redonda em 3D. Como uma bola.",
    "desc-cylinder": "Um cilindro tem duas bases circulares e lados retos.",
    "desc-cone": "Um cone tem uma base circular e afunila até um ponto.",
    "nav-home": "Início",
    "nav-about": "Sobre",
    "nav-privacy": "Privacidade",
    "nav-contact": "Contato",
    "nav-feedback": "💡 Sugestões",
    "nav-terms": "Termos",
    "footer-rights": "Todos os direitos reservados.",
    "contact-title": "Contato",
    "contact-p1": "Tem sugestões ou comentários? Ficarei feliz em saber.",
    "contact-p2": "Use o botão de feedback acima para enviar sua mensagem pelo Google Forms.",
    "contact-p3": "Leio tudo, mesmo que nem sempre possa responder. Obrigado por ajudar a melhorar o 123Trig.",
    "privacy-title": "Política de Privacidade",
    "privacy-p1": "123Trig não coleta dados pessoais. Não usamos cookies, rastreamento ou scripts de análise.",
    "privacy-p2": "Os formulários de feedback são gerenciados pelo Google Forms e seguem sua política de privacidade.",
    "about-title": "Sobre",
    "about-p1": "123Trig é uma calculadora visual gratuita criada para ajudar estudantes a compreender e resolver problemas de geometria rapidamente. Surgiu de uma frustração pessoal: via muitos alunos lutando com fórmulas mais complicadas do que o necessário.",
    "about-p2": "Queria algo pragmático, lógico e simples — uma ferramenta rápida, clara e sem distrações.",
    "about-p3": "Quer o resultado? Está aí. Esqueceu a fórmula? Está aqui. O 123Trig foi feito para reduzir a fricção e acelerar seu aprendizado.",
    "terms-title": "Termos de Serviço",
    "terms-p1": "123Trig é uma ferramenta educacional gratuita. Use por sua conta e risco.",
    "terms-p2": "Embora busquemos precisão, não garantimos que todos os resultados estejam livres de erros.",
    "terms-p3": "Ao usar este site, você concorda em não utilizá-lo para fins ilegais ou maliciosos."
  },
  "de": {
    "main-title": "123Trig",
    "tagline": "Dein Trigonometrie-Kumpel — lerne und rechne schnell mit visuellen Werkzeugen.",
    "subtitle": "Lerne und berechne Flächen, Volumen und Umfänge geometrischer Figuren in Sekunden. 123Trig ist ein kostenloses, mehrsprachiges visuelles Werkzeug — ideal für Mittel- und Oberschüler.",
    "landing-intro": "🔎 Wähle unten eine Figur und gib ihre Maße ein, um sofort Ergebnisse zu erhalten. Die Berechnungen passen sich automatisch deiner Sprache an.",
    "perimeter": "Umfang",
    "area": "Fläche",
    "volume": "Volumen",
    "units": "Einheiten",
    "radius": "Radius:",
    "side": "Seite(a):",
    "length": "Länge (l):",
    "width": "Breite (w):",
    "height": "Höhe (h):",
    "base": "Grundlinie (b):",
    "pyr-height": "Pyramidenhöhe (H):",
    "square": "Quadrat",
    "cube": "Würfel",
    "rect": "Rechteck",
    "rect-prism": "Rechteckprisma",
    "triangle": "Dreieck",
    "triangle-pyramid": "Dreieckspyramide",
    "circle": "Kreis",
    "sphere": "Kugel",
    "cylinder": "Zylinder",
    "cone": "Kegel",
    "suggestion-banner": "💡 Hilf mir besser zu werden — hast du Feedback?",
    "send-here": "Hier senden",
    "surface-area": "Oberfläche",
    "not-implemented": "Nicht berechenbar mit diesen Angaben",
    "definitions": "Begriffe",
    "desc-perimeter": "<strong>Umfang</strong> ist die Gesamtlänge um eine Figur herum. Addiere alle Seiten.",
    "desc-area": "<strong>Fläche</strong> ist der innere Bereich einer 2D-Form. Verwende Formeln wie a² oder Basis × Höhe.",
    "desc-volume": "<strong>Volumen</strong> misst den Raum, den ein 3D-Objekt einnimmt. Denk in Würfeln.",
    "desc-surface-area": "<strong>Oberfläche</strong> ist die gesamte Fläche aller Seiten einer 3D-Form.",
    "desc-square": "Ein Quadrat hat 4 gleich lange Seiten und 4 rechte Winkel. Fläche = a².",
    "desc-cube": "Ein Würfel ist ein Quadrat in 3D. Alle Kanten und Flächen sind gleich.",
    "desc-rect": "Ein Rechteck hat gegenüberliegende Seiten gleich lang und 4 rechte Winkel. Fläche = l × w.",
    "desc-rect-prism": "Ein rechteckiges Prisma ist ein quaderförmiger Körper mit 6 rechteckigen Flächen.",
    "desc-triangle": "Ein Dreieck hat 3 Seiten. Fläche = Grundlinie × Höhe ÷ 2.",
    "desc-triangle-pyramid": "Eine dreieckige Pyramide hat 4 dreieckige Flächen.",
    "desc-circle": "Ein Kreis ist eine runde 2D-Form, definiert durch den Radius.",
    "desc-sphere": "Eine Kugel ist eine perfekte runde 3D-Form. Wie ein Ball.",
    "desc-cylinder": "Ein Zylinder hat zwei kreisförmige Basen und gerade Seiten.",
    "desc-cone": "Ein Kegel hat eine kreisförmige Basis und läuft zu einer Spitze zu.",
    "nav-home": "Start",
    "nav-about": "Über uns",
    "nav-privacy": "Datenschutz",
    "nav-contact": "Kontakt",
    "nav-feedback": "💡 Feedback",
    "nav-terms": "Bedingungen",
    "footer-rights": "Alle Rechte vorbehalten.",
    "contact-title": "Kontakt",
    "contact-p1": "Hast du Feedback oder Ideen? Ich freue mich darauf.",
    "contact-p2": "Nutze oben den Feedback-Button, um deine Nachricht per Google Forms zu senden.",
    "contact-p3": "Ich lese alles, auch wenn ich nicht immer antworten kann. Danke für deine Hilfe bei 123Trig.",
    "privacy-title": "Datenschutzrichtlinie",
    "privacy-p1": "123Trig sammelt keine persönlichen Daten. Es gibt keine Cookies, Tracker oder Analyse-Skripte.",
    "privacy-p2": "Feedback-Formulare werden von Google Forms verwaltet und unterliegen deren Datenschutzrichtlinien.",
    "about-title": "Über",
    "about-p1": "123Trig ist ein kostenloser visueller Rechner, der Schülern helfen soll, Geometrieprobleme schnell zu verstehen und zu lösen. Entstanden aus persönlicher Frustration: Formeln erschienen oft unnötig kompliziert.",
    "about-p2": "Ich wollte etwas Pragmatisches, Logisches und Einfaches schaffen — ein schnelles, klares Tool ohne Ablenkungen.",
    "about-p3": "Willst du das Ergebnis? Da ist es. Formel vergessen? Hier steht sie. 123Trig wurde entwickelt, um Reibung zu vermeiden und schneller zu lernen.",
    "terms-title": "Nutzungsbedingungen",
    "terms-p1": "123Trig ist ein kostenloses Lernwerkzeug. Nutzung auf eigene Verantwortung.",
    "terms-p2": "Wir bemühen uns um Genauigkeit, übernehmen jedoch keine Garantie für fehlerfreie Ergebnisse.",
    "terms-p3": "Durch die Nutzung dieser Seite verpflichtest du dich, sie nicht für rechtswidrige Zwecke zu verwenden."
  },
  "it": {
    "main-title": "123Trig",
    "tagline": "Il tuo compagno di trigonometria — impara e calcola velocemente con strumenti visivi.",
    "subtitle": "Impara e calcola aree, volumi e perimetri di figure geometriche in pochi secondi. 123Trig è uno strumento visivo gratuito e multilingue — ideale per studenti delle scuole medie e superiori.",
    "landing-intro": "🔎 Seleziona una figura qui sotto e inserisci le dimensioni per ottenere risultati immediati. I calcoli si aggiornano automaticamente nella tua lingua.",
    "perimeter": "Perimetro",
    "area": "Area",
    "volume": "Volume",
    "units": "unità",
    "radius": "Raggio:",
    "side": "Lato(a):",
    "length": "Lunghezza (l):",
    "width": "Larghezza (w):",
    "height": "Altezza (h):",
    "base": "Base (b):",
    "pyr-height": "Altezza della Piramide (H):",
    "square": "Quadrato",
    "cube": "Cubo",
    "rect": "Rettangolo",
    "rect-prism": "Prisma Rettangolare",
    "triangle": "Triangolo",
    "triangle-pyramid": "Piramide Triangolare",
    "circle": "Cerchio",
    "sphere": "Sfera",
    "cylinder": "Cilindro",
    "cone": "Cono",
    "suggestion-banner": "💡 Aiutami a migliorare — hai un suggerimento?",
    "send-here": "Invialo qui",
    "surface-area": "Superficie",
    "not-implemented": "Non calcolabile con questi dati",
    "definitions": "Definizioni",
    "desc-perimeter": "<strong>Perimetro:</strong> somma dei lati che circondano una figura. Misura il contorno.",
    "desc-area": "<strong>Area:</strong> spazio interno a una figura piana. Usa formule come a² o base × altezza.",
    "desc-volume": "<strong>Volume:</strong> quanto spazio occupa un oggetto 3D. Immagina cubi.",
    "desc-surface-area": "<strong>Superficie:</strong> somma delle aree di tutte le facce di una figura 3D.",
    "desc-square": "Un quadrato ha 4 lati uguali e 4 angoli retti. Area = a².",
    "desc-cube": "Un cubo è un quadrato tridimensionale. Tutti i lati e le facce sono uguali.",
    "desc-rect": "Un rettangolo ha lati opposti uguali e 4 angoli retti. Area = l × w.",
    "desc-rect-prism": "Un prisma rettangolare ha forma di scatola con 6 facce rettangolari.",
    "desc-triangle": "Un triangolo ha 3 lati. Area = base × altezza ÷ 2.",
    "desc-triangle-pyramid": "Una piramide triangolare ha 4 facce triangolari.",
    "desc-circle": "Un cerchio è una figura rotonda definita dal raggio.",
    "desc-sphere": "Una sfera è una figura rotonda in 3D. Come una palla.",
    "desc-cylinder": "Un cilindro ha due basi circolari e lati diritti.",
    "desc-cone": "Un cono ha una base circolare e termina in un punto.",
    "nav-home": "Home",
    "nav-about": "Chi siamo",
    "nav-privacy": "Privacy",
    "nav-contact": "Contatto",
    "nav-feedback": "💡 Suggerimenti",
    "nav-terms": "Termini",
    "footer-rights": "Tutti i diritti riservati.",
    "contact-title": "Contatto",
    "contact-p1": "Hai suggerimenti o commenti? Mi farebbe piacere ascoltarli.",
    "contact-p2": "Usa il pulsante feedback in alto per inviare il tuo messaggio tramite Google Forms.",
    "contact-p3": "Leggo tutto, anche se non riesco sempre a rispondere. Grazie per migliorare 123Trig.",
    "privacy-title": "Informativa sulla Privacy",
    "privacy-p1": "123Trig non raccoglie dati personali. Non usiamo cookie, tracciamenti o script di analisi.",
    "privacy-p2": "I moduli di feedback sono gestiti da Google Forms e soggetti alla loro informativa sulla privacy.",
    "about-title": "Informazioni",
    "about-p1": "123Trig è una calcolatrice visiva gratuita progettata per aiutare gli studenti a capire e risolvere velocemente problemi di geometria. È nata da una frustrazione personale: troppe formule sembravano più complesse del necessario.",
    "about-p2": "Volevo qualcosa di pragmatico, logico e semplice — uno strumento veloce e chiaro, senza distrazioni.",
    "about-p3": "Vuoi il risultato? Eccolo. Hai dimenticato la formula? È qui. 123Trig elimina gli ostacoli: calcoli più rapidi, apprendimento visuale e via.",
    "terms-title": "Termini di Servizio",
    "terms-p1": "123Trig è uno strumento educativo gratuito. Usalo a tua discrezione.",
    "terms-p2": "Puntiamo all’accuratezza, ma non garantiamo che tutti i risultati siano privi di errori.",
    "terms-p3": "Utilizzando questo sito, accetti di non usarlo per scopi illegali o dannosi."
  }
}
